#Область ПрограммныйИнтерфейс

// Позиции продажи товар при изменении.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ЭтотОбъект
//  ДанныеФормы - ДанныеФормыСтруктура - Объект
//  Таблица - ДанныеФормыКоллекция
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - текущая строка табличной части
Процедура ТоварПриИзменении(Форма, ДанныеФормы, Таблица, ТекущаяСтрока) Экспорт

	Перем ДатаВремяЗаказа;
	КоличествоПоУмолчанию = 1;
	ЭтоДатаВремяЗаказа = ДанныеФормы.Свойство("Дата", ДатаВремяЗаказа);

	Если ЭтоДатаВремяЗаказа = Ложь Тогда
		ДатаВремяЗаказа = ОбщийМодульВызовСервера.ПолучитьТекущуюДату();
	КонецЕсли;

	ДатаЗаказа = НачалоДня(ДатаВремяЗаказа);
	ВыбраннаяНоменклатура = ТекущаяСтрока.Товар;

	Если Не ЗначениеЗаполнено(ВыбраннаяНоменклатура) Тогда
		
		ТекущаяСтрока.ЦенаЗаЕдиницу = 0;
		ТекущаяСтрока.Количество = 0;
		
		ПосчитатьИЗаписатьСуммуПозиции(ТекущаяСтрока);
		ПосчитатьИЗаписатьЗаказ(Форма, ДанныеФормы, Таблица);
		
		Возврат;
		
	КонецЕсли;
	
	Ответ = ОбщийМодульВызовСервера.ПолучитьЦенуИВидНоменклатуры(ДатаЗаказа, ВыбраннаяНоменклатура);
	Цена = Ответ.Цена;
	Вид = Ответ.ИмяВидаНоменклатуры;

	Если Не ЗначениеЗаполнено(Цена) И (Вид = "Товар") Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Чекни цену, братиш! Чё-то с ней не так: " + Цена;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	ТекущаяСтрока.ЦенаЗаЕдиницу = Цена;
	ТекущаяСтрока.Количество = КоличествоПоУмолчанию;
	
	ПосчитатьИЗаписатьСуммуПозиции(ТекущаяСтрока);
	ПосчитатьИЗаписатьЗаказ(Форма, ДанныеФормы, Таблица);

КонецПроцедуры

// Посчитать и записать заказ.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ЭтотОбъект
//  ДанныеФормы - ДанныеФормыСтруктура - Объект
//  Таблица - ДанныеФормыКоллекция
Процедура ПосчитатьИЗаписатьЗаказ(Форма, ДанныеФормы, Таблица) Экспорт
	
	ОбъектДляЗаполнения = Форма;
	
	Если ДанныеФормы.Свойство("СуммаЗаказа") Тогда
		ОбъектДляЗаполнения = ДанныеФормы;
	КонецЕсли;
	
	ПосчитатьИЗаписатьЦенуЗаказа(ОбъектДляЗаполнения, Таблица);
	ПосчитатьИЗаписатьСуммуЗаказа(ОбъектДляЗаполнения);
	
КонецПроцедуры

// Посчитать и записать сумму позиции.
// 
// Параметры:
//  Строка - ДанныеФормыЭлементКоллекции - Строка
Процедура ПосчитатьИЗаписатьСуммуПозиции(Строка) Экспорт
	
	Строка.СуммаПозиции = Строка.ЦенаЗаЕдиницу * Строка.Количество;
	
КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПосчитатьИЗаписатьЦенуЗаказа(ОбъектДляЗаполнения, Таблица)

	Цена = 0;
	
	Для Каждого Строка Из Таблица Цикл

		Цена = Цена + Строка.СуммаПозиции;
		
	КонецЦикла;
	
	ОбъектДляЗаполнения.Цена = Цена;
	
КонецПроцедуры

Процедура ПосчитатьИЗаписатьСуммуЗаказа(ОбъектДляЗаполнения)
	
	ОбъектДляЗаполнения.СуммаЗаказа = ОбъектДляЗаполнения.Цена - ОбъектДляЗаполнения.БаллыНаСписание;
	
КонецПроцедуры

#КонецОбласти