#Область ПрограммныйИнтерфейс

// Нормализовать номер телефона.
// 
// Параметры:
//  СыройТелефон - Строка - номер со спецсимволами. Например:
//  +375(29)123-45-67
//  +7(495)123-45-67
//  +850(123)456-7890
//  +98(123)456-7890
//  +53(123)456-7890
//  +82(123)456-7890
// 
// Возвращаемое значение:
//  Строка - нормализованный телефон только из цифр: 375291234567
Функция НормализоватьНомерТелефона(СыройТелефон) Экспорт
	
	ДопустимыеКоды = Новый Структура;
	ДопустимыеКоды.Вставить("Беларусь", "375");
	ДопустимыеКоды.Вставить("Россия", "7");
	ДопустимыеКоды.Вставить("КНДР", "850");
	ДопустимыеКоды.Вставить("Иран", "98");
	ДопустимыеКоды.Вставить("Куба", "53");
	
	ОтфильтрованныеЦифры = ОтфильтроватьЦифры(СыройТелефон);
	ЭтоДопустимыйКод = ПроверитьДопустимыеКодыТелефона(ОтфильтрованныеЦифры, ДопустимыеКоды);
	
	Если ЭтоДопустимыйКод Тогда
		
		Возврат ОтфильтрованныеЦифры;
		
	Иначе
		
		ТекстОшибки = СоставитьСообщениеОНеверномКодеТелефона(ДопустимыеКоды);
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтфильтроватьЦифры(СтрокаСЦифрами) Экспорт
	
	Цифры = "0123456789";
	ОтфильтрованныеЦифры = "";
	
	Для Счётчик = 1 По СтрДлина(СтрокаСЦифрами) Цикл
	
		Символ = Сред(СтрокаСЦифрами, Счётчик, 1);
		
		Если СтрНайти(Цифры, Символ) <> 0 Тогда
			
			ОтфильтрованныеЦифры = ОтфильтрованныеЦифры + Символ;
			
		Иначе
			
			Продолжить;

		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ОтфильтрованныеЦифры;
	
КонецФункции

Функция ПроверитьДопустимыеКодыТелефона(ПроверяемыйТелефон, ДопустимыеКоды) Экспорт
	
	ЭтоДопустимыйКод = Ложь;
	
	Для Каждого Код Из ДопустимыеКоды Цикл
		
//		Страна = Код.Ключ;
		ТелефонныйКод = Код.Значение;
		
		Если СтрНачинаетсяС(ПроверяемыйТелефон, ТелефонныйКод) Тогда
			
			ЭтоДопустимыйКод = Истина;
			Прервать
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЭтоДопустимыйКод;
	
КонецФункции

Функция СоставитьСообщениеОНеверномКодеТелефона(ДопустимыеКоды) Экспорт
	
	Сообщение = Символы.ПС + "Неподдерживаемый код страны. Допустимые коды:" + Символы.ПС;
	
	Для Каждого Код Из ДопустимыеКоды Цикл

		Страна = Код.Ключ;
		ТелефонныйКод = Код.Значение;
		Сообщение = Сообщение + Страна + ": " + ТелефонныйКод + Символы.ПС;

	КонецЦикла;
	
	Возврат Сообщение;
	
КонецФункции

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти