// @strict-types

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ОбработчикиСобытийФормы
//
//#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)

	Заказ = Объект.Заказ;
	
	Если ЗначениеЗаполнено(Заказ) Тогда
		
		ДанныеЗаказа = ПолучитьДанныеЗаказа(Заказ);
		Объект.Курьер = ДанныеЗаказа.Курьер;
		Объект.СуммаЗаказа = ДанныеЗаказа.СуммаЗаказа;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиКомандФормы
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить данные заказа.
// 
// Параметры:
//  СсылкаЗаказ - ДокументСсылка.Заказ
// 
// Возвращаемое значение:
//  Структура - Получить данные заказа:
// * Курьер - СправочникСсылка.Курьеры - 
// * СуммаЗаказа - Число - 
&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаказа(СсылкаЗаказ)
	
	Результат = Новый Структура("Курьер, СуммаЗаказа", Справочники.Курьеры.ПустаяСсылка(), 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Заказ.Курьер КАК Курьер,
		|	Заказ.СуммаЗаказа КАК СуммаЗаказа
		|ИЗ
		|	Документ.Заказ КАК Заказ
		|ГДЕ
		|	Заказ.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаЗаказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда

		Результат.Курьер = Выборка.Курьер;
		Результат.СуммаЗаказа = Выборка.СуммаЗаказа;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти