#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЦену(Период, Номенклатура) Экспорт
	
	Перем Результат;

	ЗапросЦенНаДату = Новый Запрос;
	
	ЗапросЦенНаДату.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК
		|		ЦеныНоменклатурыСрезПоследних";
		
		ЗапросЦенНаДату.УстановитьПараметр("Период", Период);
		ЗапросЦенНаДату.УстановитьПараметр("Номенклатура", Номенклатура);
		Выборка = ЗапросЦенНаДату.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Цена;
		
	Иначе
		
		Результат = 0;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти