// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не ЗначениеЗаполнено(Клиент) Тогда

		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите клиента";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Клиент";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	МаксимальнаяДоляОплатыБаллами = Константы.МаксимальнаяДоляОплатыБаллами.Получить();

	Если БаллыНаСписание <> 0 Тогда
		
		Если БаллыНаСписание > Цена Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Списываемые баллы превышают цену заказа";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Поле = "БаллыНаСписание";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Если Цена <> 0 Тогда
			
			ДоляБалловОтЦены = БаллыНаСписание / Цена * 100;
			ДопустимоеКоличествоБаллов = Цена * МаксимальнаяДоляОплатыБаллами / 100;
			ДопустимоеКоличествоБалловДваЗнака = ОбщиеФункцииКлиентСервер.ОбрезатьДробнуюЧастьДоДвухЗнаков(ДопустимоеКоличествоБаллов);
			
			Если ДоляБалловОтЦены > МаксимальнаяДоляОплатыБаллами Тогда
				
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Превышена максимальная доля баллов: %1%%. Для цены %2 максимальное число баллов: %3", МаксимальнаяДоляОплатыБаллами, Цена, ДопустимоеКоличествоБалловДваЗнака);
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Поле = "БаллыНаСписание";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ДоставкиИОплаты
	Движения.ДоставкиИОплаты.Записывать = Истина;
	ДвижениеНеоплаченныеЗаказы = Движения.ДоставкиИОплаты.Добавить();
	ДвижениеНеоплаченныеЗаказы.Период = Дата;
	ДвижениеНеоплаченныеЗаказы.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеНеоплаченныеЗаказы.ОснованиеПлатежа = Ссылка;
	ДвижениеНеоплаченныеЗаказы.Ответственный = Курьер;
	ДвижениеНеоплаченныеЗаказы.КоличествоНеоплаченныхЗаказов = 1;
	ДвижениеНеоплаченныеЗаказы.НеоплаченнаяСуммаЗаказов = СуммаЗаказа;

	// регистр Продажи
	Движения.Продажи.Записывать = Истина;

	Для Каждого ТекСтрокаПозицииПродажи из ПозицииПродажи Цикл

		ДвижениеПродажи = Движения.Продажи.Добавить();
		ДвижениеПродажи.Период = Дата;
		ДвижениеПродажи.Товар = ТекСтрокаПозицииПродажи.Товар;
		ДвижениеПродажи.Количество = ТекСтрокаПозицииПродажи.Количество;
		ДвижениеПродажи.Клиент = Клиент;
		ДвижениеПродажи.Сумма = ТекСтрокаПозицииПродажи.СуммаПозиции;

	КонецЦикла;
	
	// регистр БонусныеБаллыКлиентов
	ОбработатьБонусныеБаллы(Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ОбщийМодульВызовСервера.ВернутьТекущегоПользователя();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ОбщийМодульВызовСервера.ВернутьТекущегоПользователя();
КонецПроцедуры

#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьБонусныеБаллы(Отказ)

	Движения.БонусныеБаллыКлиентов.Записывать = Истина;
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат;
	КонецЕсли;
	
	БаллыКНакоплению = ОбщийМодульВызовСервера.ПолучитьБаллыКНакоплениюЧерезКлиента(
		Новый Граница(МоментВремени(), ВидГраницы.Исключая),
		Клиент,
		Дата,
		Цена
	);

	Если БаллыКНакоплению <> 0 Тогда
		
		Движение = Движения.БонусныеБаллыКлиентов.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.СуммаБаллов = БаллыКНакоплению;
		
	КонецЕсли;
	
	Если БаллыНаСписание <> 0 Тогда
		
		Движение = Движения.БонусныеБаллыКлиентов.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.СуммаБаллов = БаллыНаСписание;
		
	КонецЕсли;
	
	Движения.Записать();

	ОтрицательнаяСуммаБалловОстаток = ОбщийМодульВызовСервера.ПолучитьОтрицательнуюСуммуБалловНаПериод(
		Новый Граница(МоментВремени(),
		ВидГраницы.Включая),
		Клиент
	);

	Если ЗначениеЗаполнено(ОтрицательнаяСуммаБалловОстаток) Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(
			"Доступно баллов к списанию: %1",
			ОтрицательнаяСуммаБалловОстаток + БаллыНаСписание
		);
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "БаллыНаСписание";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
