// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

#Область ПрограммныйИнтерфейс

// Генерировать тестовые данные.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ГенерироватьТестовыеДанные(Сообщать = Истина) Экспорт

	//	Справочники
	ГенерироватьКлиентов(Сообщать);
	ГенерироватьВидыКухни(Сообщать);
	ГенерироватьНоменклатуру(Сообщать);
	ГенерироватьКурьеров(Сообщать);
	ГенерироватьВелосипеды(Сообщать);
	//	Документы
	ГенерироватьЦены(Сообщать);
	ГенерироватьШкалыБонусов(Сообщать);
	ГенерироватьЗаказы(Сообщать);
	ГенерироватьОплатыЗаказов(Сообщать);

КонецПроцедуры

// Очистить тестовые данные.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ОчиститьТестовыеДанные(Сообщать = Истина) Экспорт
	
	//	Справочники
	ОчиститьКлиентов(Сообщать);
	ОчиститьВидыКухни(Сообщать);
	ОчиститьНоменклатуру(Сообщать);
	ОчиститьКурьеров(Сообщать);
	ОчиститьВелосипеды(Сообщать);
	//	Документы
	ОчиститьЦены(Сообщать);
	ОчиститьШкалыБонусов(Сообщать);
	ОчиститьЗаказы(Сообщать);
	ОчиститьОплатыЗаказов(Сообщать);
	
КонецПроцедуры

// Генерировать клиентов.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ГенерироватьКлиентов(Сообщать = Ложь) Экспорт
	
	ОчиститьКлиентов();
	
	ТеннисистыТекст = ПолучитьМакет("Теннисисты").ПолучитьТекст();
	МассивКлиентов = СтрРазделить(ТеннисистыТекст, Символы.ПС);
	КоличествоКлиентов = МассивКлиентов.Количество();
	ТелефоныТекст = ПолучитьМакет("Телефоны").ПолучитьТекст();
	МассивТелефонов = СтрРазделить(ТелефоныТекст, Символы.ПС);
	КоличествоТелефонов = МассивТелефонов.Количество();
	АдресаТекст = ПолучитьМакет("Адреса").ПолучитьТекст();
	МассивАдресов = СтрРазделить(АдресаТекст, Символы.ПС);
	КоличествоАдресов = МассивАдресов.Количество();
	ДопустимыеКоды = ОбщиеФункцииКлиентСервер.ПолучитьДопустимыеКоды();
	МассивКодов = Новый Массив; // Массив из Строка
	
	Для Каждого СвойствоКод Из ДопустимыеКоды Цикл
		
		Код = СвойствоКод.Значение; // Строка
		МассивКодов.Добавить(Код);
		
	КонецЦикла;
	
	КоличествоЗаписейКлиентов = Мин(КоличествоКлиентов, КоличествоТелефонов, КоличествоАдресов);
	ГСЧ = Новый ГенераторСлучайныхЧисел();

	Для Индекс = 1 По КоличествоЗаписейКлиентов Цикл
		
		ИндексМассива = Индекс - 1;
		ИндексМассиваКода = ГСЧ.СлучайноеЧисло(0, МассивКодов.Количество() - 1);
		
		Клиент = Справочники.Клиенты.СоздатьЭлемент();
		Клиент.Наименование = МассивКлиентов[ИндексМассива];
		Клиент.Телефон = МассивКодов[ИндексМассиваКода] + МассивТелефонов[ИндексМассива];
		Клиент.Адрес = МассивАдресов[ИндексМассива];
		Клиент.Записать();
		
	КонецЦикла;
	
	Если Сообщать Тогда	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сгенерировано клиентов: " + КоличествоЗаписейКлиентов;
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

// Очистить клиентов.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ОчиститьКлиентов(Сообщать = Ложь) Экспорт
	
	Выборка = Справочники.Клиенты.Выбрать();
	КоличествоЗаписейКлиентов = 0;
	
	Пока Выборка.Следующий() Цикл

		Объект = Выборка.ПолучитьОбъект();
		Объект.ОбменДанными.Загрузка = Истина; 
		Объект.Удалить();
		
		КоличествоЗаписейКлиентов = КоличествоЗаписейКлиентов + 1;

	КонецЦикла;
	
	Если Сообщать Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Очищено клиентов: " + КоличествоЗаписейКлиентов;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Генерировать виды кухни.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ГенерироватьВидыКухни(Сообщать = Ложь) Экспорт
	
	ОчиститьВидыКухни();
	
	ВидыКухниТекст = ПолучитьМакет("ВидыКухни").ПолучитьТекст();
	МассивКухонь = СтрРазделить(ВидыКухниТекст, Символы.ПС);
	КоличествоКухонь = МассивКухонь.Количество();
	
	Для Индекс = 1 По КоличествоКухонь Цикл
		
		ИндексМассива = Индекс - 1;
		
		ВидКухни = Справочники.ВидыКухни.СоздатьЭлемент();
		ВидКухни.Наименование = МассивКухонь[ИндексМассива];
		ВидКухни.Записать();
		
	КонецЦикла;
	
	Если Сообщать Тогда	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сгенерировано видов кухонь: " + КоличествоКухонь;
		Сообщение.Сообщить();
	
	КонецЕсли;
	
КонецПроцедуры

// Очистить виды кухни.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ОчиститьВидыКухни(Сообщать = Ложь) Экспорт
	
	Выборка = Справочники.ВидыКухни.Выбрать();
	КоличествоКухонь = 0;
	
	Пока Выборка.Следующий() Цикл

		Объект = Выборка.ПолучитьОбъект();
		Объект.ОбменДанными.Загрузка = Истина; 
		Объект.Удалить();
		
		КоличествоКухонь = КоличествоКухонь + 1;

	КонецЦикла;
	
	Если Сообщать Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Очищено видов кухонь: " + КоличествоКухонь;
		Сообщение.Сообщить();
	
	КонецЕсли;
		
КонецПроцедуры

// Генерировать номенклатуру.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ГенерироватьНоменклатуру(Сообщать = Ложь) Экспорт
	
	ОчиститьНоменклатуру();
	
	ТоварыГруппа = Справочники.Номенклатура.СоздатьГруппу();
	ТоварыГруппа.Наименование = "Товары";
	ТоварыГруппа.Записать();
	
	ТоварыМакет = ПолучитьМакет("Товары");
	КоличествоТоваров = ТоварыМакет.ВысотаТаблицы;
	
	Для НомерСтроки = 1 По КоличествоТоваров Цикл
		
		НазваниеТовара = ТоварыМакет.Область(НомерСтроки, 1).Текст;
		НазваниеКухни = ТоварыМакет.Область(НомерСтроки, 2).Текст;
		ВидКухни = Справочники.ВидыКухни.НайтиПоНаименованию(НазваниеКухни);
		
		Товар = Справочники.Номенклатура.СоздатьЭлемент();
		Товар.Родитель = ТоварыГруппа.Ссылка;
		Товар.Наименование = НазваниеТовара;
		Товар.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Товар;
		Товар.ВидКухни = ВидКухни;
		Товар.Записать();
		
	КонецЦикла;
	
	УслугиГруппа = Справочники.Номенклатура.СоздатьГруппу();
	УслугиГруппа.Наименование = "Услуги";
	УслугиГруппа.Записать();
	
	УслугиТекст = ПолучитьМакет("Услуги").ПолучитьТекст();
	МассивУслуг = СтрРазделить(УслугиТекст, Символы.ПС);
	КоличествоУслуг = МассивУслуг.Количество();
	
	Для Индекс = 1 По КоличествоУслуг Цикл
		
		ИндексМассива = Индекс - 1;
		
		Услуга = Справочники.Номенклатура.СоздатьЭлемент();
		Услуга.Родитель = УслугиГруппа.Ссылка;
		Услуга.Наименование = МассивУслуг[ИндексМассива];
		Услуга.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Услуга;
		Услуга.Записать();
		
	КонецЦикла;
	
	КоличествоНоменклатуры = КоличествоТоваров + КоличествоУслуг;
	
	Если Сообщать Тогда	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сгенерировано номенклатуры: " + КоличествоНоменклатуры;
		Сообщение.Сообщить();
	
	КонецЕсли;
	
КонецПроцедуры

// Очистить номенклатуру.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ОчиститьНоменклатуру(Сообщать = Ложь) Экспорт
	
	Выборка = Справочники.Номенклатура.Выбрать();
	КоличествоНоменклатуры = 0;
	
	Пока Выборка.Следующий() Цикл

		Объект = Выборка.ПолучитьОбъект();
		
		Если Не Объект.ЭтоГруппа Тогда
			КоличествоНоменклатуры = КоличествоНоменклатуры + 1;
		КонецЕсли;
		
		Объект.ОбменДанными.Загрузка = Истина; 
		Объект.Удалить();

	КонецЦикла;
	
	Если Сообщать Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Очищено номенклатуры: " + КоличествоНоменклатуры;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Генерировать курьеров.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ГенерироватьКурьеров(Сообщать = Ложь) Экспорт
	
	ОчиститьКурьеров();
	
	КурьерыМакет = ПолучитьМакет("ПрезидентыАмерики");
	КоличествоКурьеров = КурьерыМакет.ВысотаТаблицы;
	
	Для НомерСтроки = 1 По КоличествоКурьеров Цикл
		
		ИмяКурьера = КурьерыМакет.Область(НомерСтроки, 1).Текст;
		ТарифКурьера = КурьерыМакет.Область(НомерСтроки, 2).Текст;
		
		Курьер = Справочники.Курьеры.СоздатьЭлемент();
		Курьер.Наименование = ИмяКурьера;
		Курьер.Тариф = Число(ТарифКурьера);
		Курьер.Записать();
		
	КонецЦикла;

	Если Сообщать Тогда	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сгенерировано курьеров: " + КоличествоКурьеров;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Очистить курьеров.
// 
// Параметры:
//  Сообщать - Булево - Соообщать
Процедура ОчиститьКурьеров(Сообщать = Ложь) Экспорт
	
	Выборка = Справочники.Курьеры.Выбрать();
	КоличествоКурьеров = 0;
	
	Пока Выборка.Следующий() Цикл

		Объект = Выборка.ПолучитьОбъект();
		Объект.ОбменДанными.Загрузка = Истина; 
		Объект.Удалить();
		
		КоличествоКурьеров = КоличествоКурьеров + 1;

	КонецЦикла;
	
	Если Сообщать Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Очищено курьеров: " + КоличествоКурьеров;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

// Генерировать велосипеды.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ГенерироватьВелосипеды(Сообщать = Ложь) Экспорт
	
	ОчиститьВелосипеды();
	
	ВелосипедыТекст = ПолучитьМакет("Велосипеды").ПолучитьТекст();
	МассивНазванийВелосипедов = СтрРазделить(ВелосипедыТекст, Символы.ПС);
	КоличествоНазванийВелосипедов = МассивНазванийВелосипедов.Количество();
	СерийныеНомераТекст = ПолучитьМакет("СерийныеНомераВелосипедов").ПолучитьТекст();
	МассивСерийныхНомеров = СтрРазделить(СерийныеНомераТекст, Символы.ПС);
	КоличествоСерийныхНомеров = МассивСерийныхНомеров.Количество();
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();

	Для Индекс = 1 По КоличествоСерийныхНомеров Цикл
		
		ИндексМассива = Индекс - 1;
		ИндексМассиваНазванийВелосипедов = ГСЧ.СлучайноеЧисло(0, КоличествоНазванийВелосипедов - 1);
		
		Велосипед = Справочники.Велосипеды.СоздатьЭлемент();
		Велосипед.Наименование = МассивНазванийВелосипедов[ИндексМассиваНазванийВелосипедов];
		Велосипед.СерийныйНомер = МассивСерийныхНомеров[ИндексМассива];
		Велосипед.Записать();
		
	КонецЦикла;

	Если Сообщать Тогда	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сгенерировано велосипедов: " + КоличествоСерийныхНомеров;
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

// Очистить велосипеды.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ОчиститьВелосипеды(Сообщать = Ложь) Экспорт
		
	Выборка = Справочники.Велосипеды.Выбрать();
	КоличествоВелосипедвов = 0;
	
	Пока Выборка.Следующий() Цикл

		Объект = Выборка.ПолучитьОбъект();
		Объект.ОбменДанными.Загрузка = Истина; 
		Объект.Удалить();
		
		КоличествоВелосипедвов = КоличествоВелосипедвов + 1;

	КонецЦикла;
	
	Если Сообщать Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Очищено велосипедов: " + КоличествоВелосипедвов;
		Сообщение.Сообщить();
	
	КонецЕсли;

КонецПроцедуры

// Генерировать цены.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ГенерироватьЦены(Сообщать = Ложь) Экспорт
	
	ОчиститьЦены();
	
	УстановкаЦены = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	
	УстановкаЦены.Заполнить(Неопределено);
	
	УстановкаЦены.Дата = Период.ДатаНачала;
	УстановкаЦены.Комментарий = "Сгенерировано внешней обработкой ""ДляРазработки"" со случайными ценами для тестирования";
	
	СчётчикТоваров = 0;
	СчётчикУслуг = 0;
	
	Выборка = ОбщийМодульВызовСервера.ПолучитьНоменклатуру();

	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Товар Тогда
			
			СтрокаЦенаНоменклатуры = УстановкаЦены.ЦеныНоменклатуры.Добавить();
			СтрокаЦенаНоменклатуры.Номенклатура = Выборка.Ссылка;
			
			Если СтрНайти(Выборка.Наименование, "(бесценно)") > 0 Тогда
				СтрокаЦенаНоменклатуры.Цена = 0;
			Иначе
				СтрокаЦенаНоменклатуры.Цена = ОбщийМодульВызовСервера.ГенераторСлучайныхДробныхЧисел(15, 150, 2);
			КонецЕсли;
			
			СчётчикТоваров = СчётчикТоваров + 1;
			
		КонецЕсли;
		
		Если Выборка.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Услуга Тогда
//			СчётчикУслуг = СчётчикУслуг + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	УстановкаЦены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	
	КоличествоЦен = СчётчикТоваров + СчётчикУслуг;
	
	Если Сообщать Тогда	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сгенерировано цен: " + КоличествоЦен;
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

// Очистить цены.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ОчиститьЦены(Сообщать = Ложь) Экспорт
	
	Выборка = Документы.УстановкаЦенНоменклатуры.Выбрать();
	КоличествоУстановокЦен = 0;
	
	Пока Выборка.Следующий() Цикл

		Объект = Выборка.ПолучитьОбъект();
		
        Если Объект.Проведен Тогда
            Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
        КонецЕсли;		

		Объект.ОбменДанными.Загрузка = Истина; 
		Объект.Удалить();
		
		КоличествоУстановокЦен = КоличествоУстановокЦен + 1;

	КонецЦикла;

	Если Сообщать Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Очищено установок цен: " + КоличествоУстановокЦен;
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

// Генерировать шкалы бонусов.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ГенерироватьШкалыБонусов(Сообщать = Ложь) Экспорт
	
	ОчиститьШкалыБонусов();
	
	УстановкаШкалыБонусов = Документы.ШкалаБонусов.СоздатьДокумент();
	
	УстановкаШкалыБонусов.Заполнить(Неопределено);
	
	УстановкаШкалыБонусов.Дата = Период.ДатаНачала;
	
	СчётчикДиапазонов = 0;
	
	ШкалаБонусовМакет = ПолучитьМакет("ШкалаБонусов");
	КоличествоДиапазонов = ШкалаБонусовМакет.ВысотаТаблицы;
	
	Для НомерСтроки = 1 По КоличествоДиапазонов Цикл
		
		НижняяГраница = Число(ШкалаБонусовМакет.Область(НомерСтроки, 1).Текст);
		ВерхняяГраница = Число(ШкалаБонусовМакет.Область(НомерСтроки, 2).Текст);
		ПроцентНакопления = Число(ШкалаБонусовМакет.Область(НомерСтроки, 3).Текст);
		
		ДиапазонШкалыБонусов = УстановкаШкалыБонусов.Диапазоны.Добавить();
		ДиапазонШкалыБонусов.НижняяГраница = НижняяГраница;
		ДиапазонШкалыБонусов.ВерхняяГраница = ВерхняяГраница;
		ДиапазонШкалыБонусов.ПроцентНакопления = ПроцентНакопления;
			
		СчётчикДиапазонов = СчётчикДиапазонов + 1;
		
	КонецЦикла;
	
	УстановкаШкалыБонусов.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	
	Если Сообщать Тогда	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сгенерировано диапазонов шкалы бонусов: " + СчётчикДиапазонов;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Очистить шкалы бонусов.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ОчиститьШкалыБонусов(Сообщать = Ложь) Экспорт
	
	Выборка = Документы.ШкалаБонусов.Выбрать();
	КоличествоШкалБонусов = 0;
	
	Пока Выборка.Следующий() Цикл

		Объект = Выборка.ПолучитьОбъект();
		
        Если Объект.Проведен Тогда
            Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
        КонецЕсли;		

		Объект.ОбменДанными.Загрузка = Истина; 
		Объект.Удалить();
		
		КоличествоШкалБонусов = КоличествоШкалБонусов + 1;

	КонецЦикла;

	Если Сообщать Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Очищено шкал бонусов: " + КоличествоШкалБонусов;
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

// Генерировать заказы.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ГенерироватьЗаказы(Сообщать = Ложь) Экспорт
	
	ОчиститьЗаказы();
	
	МаксимальнаяДоляОплатыБаллами = Константы.МаксимальнаяДоляОплатыБаллами.Получить();
	
	Если МаксимальнаяДоляОплатыБаллами = 0 Или Не ЗначениеЗаполнено(МаксимальнаяДоляОплатыБаллами) Тогда
		Константы.МаксимальнаяДоляОплатыБаллами.Установить(10);
	КонецЕсли;
	
	ДатаНачала = НачалоДня(Период.ДатаНачала);
	ДатаОкончания = НачалоДня(Период.ДатаОкончания);
	ТекущаяДата = ДатаНачала;
	СекундВСутках = ОбщиеФункцииКлиентСервер.ВернутьКоличествоСекундВСутках();
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	ВыборкаКлиентов = Справочники.Клиенты.Выбрать();
	МассивКлиентовЗапасной = Новый Массив; // Массив из Структура: Ссылка: СправочникСсылка.Клиенты, Адрес: Строка
	
	Пока ВыборкаКлиентов.Следующий() Цикл

		КлиентИзВыборки = Новый Структура("Ссылка, Адрес", ВыборкаКлиентов.Ссылка, ВыборкаКлиентов.Адрес);
		МассивКлиентовЗапасной.Добавить(КлиентИзВыборки);
		
	КонецЦикла;
	
	КоличествоКлиентов = МассивКлиентовЗапасной.Количество();
	
	ВыборкаКурьеров = Справочники.Курьеры.Выбрать();
	МассивКурьеров = Новый Массив; // Массив из СправочникСсылка.Курьеры
	
	Пока ВыборкаКурьеров.Следующий() Цикл
		МассивКурьеров.Добавить(ВыборкаКурьеров.Ссылка);
	КонецЦикла;
	
	ВыборкаТранспорта = Справочники.Велосипеды.Выбрать();
	МассивТранспорта = Новый Массив; // Массив из СправочникСсылка.Велосипеды
	
	Пока ВыборкаТранспорта.Следующий() Цикл
		МассивТранспорта.Добавить(ВыборкаТранспорта.Ссылка);
	КонецЦикла;
	
	СчётчикЗаказовЗаПериод = 0;

	Пока ТекущаяДата <= ДатаОкончания Цикл
		
		МассивКлиентов = Новый Массив(); // Массив из Структура: Ссылка: СправочникСсылка.Клиенты, Адрес: Строка
		
		Для ИндексКлиента = 0 По МассивКлиентовЗапасной.Количество() - 1 Цикл
			МассивКлиентов.Добавить(МассивКлиентовЗапасной[ИндексКлиента]);			
		КонецЦикла;
		
		ДеньНедели = ДеньНедели(ТекущаяДата);
		ЭтоВыходные = (ДеньНедели = 6 ИЛИ ДеньНедели = 7);
		ДиапазонКоличестваЗаказов = Новый Структура;
		ДатаИВремяНачалаРаботы = ТекущаяДата + 3600 * 8;
		ПродолжительностьРабочегоДняВСекундах = 3600 * 12;
		
		Если ЭтоВыходные Тогда
			
			ДиапазонКоличестваЗаказов.Вставить("МинимумЗаказов", КоличествоКлиентов * 0.5);
			ДиапазонКоличестваЗаказов.Вставить("МаксимумЗаказов", КоличествоКлиентов * 1.2);
			
		Иначе
			
			ДиапазонКоличестваЗаказов.Вставить("МинимумЗаказов", КоличествоКлиентов * 0.1);
			ДиапазонКоличестваЗаказов.Вставить("МаксимумЗаказов", КоличествоКлиентов * 0.25);
			
		КонецЕсли;
		
		ЗаказовВЭтотДень = ГСЧ.СлучайноеЧисло(
			ДиапазонКоличестваЗаказов.МинимумЗаказов,
			ДиапазонКоличестваЗаказов.МаксимумЗаказов
		);
		
		СекундМеждуЗаказами = ПродолжительностьРабочегоДняВСекундах / ЗаказовВЭтотДень;
		ДатаИВремяЗаказа = ДатаИВремяНачалаРаботы;
		
		ВыборкаТоваровСЦеной = ОбщийМодульВызовСервера.ПолучитьТоварыСЦеной(ТекущаяДата);
		МассивТоваровСЦеной = Новый Массив; // Массив из см. ОбщийМодульВызовСервера.ПолучитьСтруктуруТовара
		МассивТоваровСЦенойЗапасной = Новый Массив; // Массив из см. ОбщийМодульВызовСервера.ПолучитьСтруктуруТовара
		
		ИндексКурьера = 0;
		ИндексТранспорта = 0;

		Пока ВыборкаТоваровСЦеной.Следующий() Цикл
			
			ТоварСтруктура = ОбщийМодульВызовСервера.ПолучитьСтруктуруТовара(ВыборкаТоваровСЦеной);
			МассивТоваровСЦеной.Добавить(ТоварСтруктура);
			МассивТоваровСЦенойЗапасной.Добавить(ТоварСтруктура);

		КонецЦикла;
		
		Для СчётчикЗаказов = 1 По ЗаказовВЭтотДень Цикл
			
			Если МассивКлиентов.Количество() = 0 Тогда

				Для ИндексКлиента = 0 По МассивКлиентовЗапасной.Количество() - 1 Цикл
					МассивКлиентов.Добавить(МассивКлиентовЗапасной[ИндексКлиента]);
				КонецЦикла;
				
			КонецЕсли;
			
			СлучайныйКлиентИндекс = ГСЧ.СлучайноеЧисло(0, МассивКлиентов.Количество() - 1);
			СлучайныйКлиент = ВернутьДанныеОКлиенте(СлучайныйКлиентИндекс, МассивКлиентов);
			МассивКлиентов.Удалить(СлучайныйКлиентИндекс);
			
			ЗадержкаМеждуЗаказами = СекундМеждуЗаказами - (ГСЧ.СлучайноеЧисло(5, 10));
			ДатаИВремяЗаказа = ДатаИВремяЗаказа + ЗадержкаМеждуЗаказами;
			
			Если ИндексКурьера = МассивКурьеров.Количество() Тогда
				ИндексКурьера = 0;
			КонецЕсли;
			
			Если ИндексТранспорта = МассивТранспорта.Количество() Тогда
				ИндексТранспорта = 0;
			КонецЕсли;
			
			ПозицийВЗаказе = ГСЧ.СлучайноеЧисло(1, 3);
			
			Заказ = Документы.Заказ.СоздатьДокумент();
			
			Заказ.Заполнить(Неопределено);
			
			Заказ.Дата = ДатаИВремяЗаказа;
			Заказ.Клиент = СлучайныйКлиент.Ссылка;
			Заказ.Адрес = СлучайныйКлиент.Адрес;
			Заказ.Курьер = МассивКурьеров[ИндексКурьера];
			Заказ.Транспорт = МассивТранспорта[ИндексТранспорта];
			ЦенаЗаказа = 0;
			
			Для СчётчикПозиций = 1 По ПозицийВЗаказе Цикл
				
				СлучайныйТоварИндекс = ГСЧ.СлучайноеЧисло(0, МассивТоваровСЦеной.Количество() - 1);
				СлучайныйТовар = МассивТоваровСЦеной[СлучайныйТоварИндекс];
				МассивТоваровСЦеной.Удалить(СлучайныйТоварИндекс);
				
				Товар = Заказ.ПозицииПродажи.Добавить();
				Товар.Товар = СлучайныйТовар.СсылкаНаНоменклатуру;
				Товар.ЦенаЗаЕдиницу = СлучайныйТовар.Цена;
				Товар.Количество = ГСЧ.СлучайноеЧисло(1, 5);
				Товар.СуммаПозиции = Товар.ЦенаЗаЕдиницу * Товар.Количество;
				
				ЦенаЗаказа = ЦенаЗаказа + Товар.СуммаПозиции;
				
			КонецЦикла;
			
			Заказ.Цена = ЦенаЗаказа;
			
			ИнформацияОКлиенте = ОбщийМодульВызовСервера.ПолучитьИнформациюОКлиенте(
				Заказ.Ссылка,
				ДатаИВремяЗаказа,
				СлучайныйКлиент.Ссылка,
				ЦенаЗаказа
			);

			СтарыеИНовыеБаллы = ИнформацияОКлиенте.СуммаБалловОстаток + ИнформацияОКлиенте.БаллыКНакоплению;
			МаксимальнаяДоляОплатыБалламиДляЭтогоЗаказа = ЦенаЗаказа * МаксимальнаяДоляОплатыБаллами / 100;
			МаксимальнаяДоляДваЗнака = ОбщиеФункцииКлиентСервер.ОбрезатьДробнуюЧастьДоДвухЗнаков(
				МаксимальнаяДоляОплатыБалламиДляЭтогоЗаказа
			);
			
			МожноСписатьКоличество = Мин(СтарыеИНовыеБаллы, МаксимальнаяДоляДваЗнака);
			БаллыНаСписание = ОбщийМодульВызовСервера.ГенераторСлучайныхДробныхЧисел(0, МожноСписатьКоличество, 2);
			Заказ.БаллыНаСписание = БаллыНаСписание;
			Заказ.СуммаЗаказа = ЦенаЗаказа - БаллыНаСписание;
			
			Если Не Заказ.ПроверитьЗаполнение() Тогда
				Возврат;
			КонецЕсли;
		
			Заказ.Записать(РежимЗаписиДокумента.Проведение);
			
			Если Заказ.Проведен Тогда
		
				ИндексКурьера = ИндексКурьера + 1;
				ИндексТранспорта = ИндексТранспорта + 1;
				
				МассивТоваровСЦеной = Новый Массив(); // Массив из см. ОбщийМодульВызовСервера.ПолучитьСтруктуруТовара
				
				Для ИндексТоваровСЦеной = 0 По МассивТоваровСЦенойЗапасной.Количество() - 1 Цикл
					МассивТоваровСЦеной.Добавить(МассивТоваровСЦенойЗапасной[ИндексТоваровСЦеной]);
				КонецЦикла;
				
				СчётчикЗаказовЗаПериод = СчётчикЗаказовЗаПериод + 1;

			Иначе
				Возврат;
			КонецЕсли;
					
		КонецЦикла;
		
		ТекущаяДата = ТекущаяДата + СекундВСутках;
		
	КонецЦикла;
	
	Если Сообщать Тогда	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сгенерировано заказов: " + СчётчикЗаказовЗаПериод;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Очистить заказы.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ОчиститьЗаказы(Сообщать = Ложь) Экспорт
		
	Выборка = Документы.Заказ.Выбрать();
	КоличествоЗаказов = 0;
	
	Пока Выборка.Следующий() Цикл

		Объект = Выборка.ПолучитьОбъект();
		
        Если Объект.Проведен Тогда
            Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
        КонецЕсли;		

		Объект.ОбменДанными.Загрузка = Истина; 
		Объект.Удалить();
		
		КоличествоЗаказов = КоличествоЗаказов + 1;

	КонецЦикла;

	Если Сообщать Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Очищено заказов: " + КоличествоЗаказов;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Генерировать оплаты заказов.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ГенерироватьОплатыЗаказов(Сообщать = Ложь) Экспорт

	ОчиститьОплатыЗаказов();
	
	ПоследняяДата = ОбщийМодульВызовСервера.ПолучитьДатуПоследнегоЗаказа();
	Заказы = ОбщийМодульВызовСервера.ПолучитьЗаказы();

	СчётчикОплатЗаказов = 0;
	
	Пока Заказы.Следующий() Цикл
		
		ДатаЗаказа = Заказы.Дата;
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
		
		Если НачалоДня(ДатаЗаказа) = НачалоДня(ПоследняяДата) Тогда
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
		ГСЧ = Новый ГенераторСлучайныхЧисел();
		ЗадержкаМеждуЗаказомИДоставкой = ГСЧ.СлучайноеЧисло(600, 1200);
		ДатаОплаты = ДатаЗаказа + ЗадержкаМеждуЗаказомИДоставкой;
		
		Оплата = Документы.ОплатаЗаказа.СоздатьДокумент();
	
		Оплата.Заполнить(Неопределено);
		
		Оплата.Дата = ДатаОплаты;
		Оплата.Заказ = Заказы.Ссылка;
		Оплата.СуммаЗаказа = Заказы.СуммаЗаказа;
		Оплата.Курьер = Заказы.Курьер;
		
		Оплата.Записать(РежимЗаписи, РежимПроведенияДокумента.Неоперативный);
		
		СчётчикОплатЗаказов = СчётчикОплатЗаказов + 1;
		
	КонецЦикла;
	
	Если Сообщать Тогда	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сгенерировано оплат заказов: " + СчётчикОплатЗаказов;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Очистить оплаты заказов.
// 
// Параметры:
//  Сообщать - Булево - Сообщать
Процедура ОчиститьОплатыЗаказов(Сообщать = Ложь) Экспорт
		
	Выборка = Документы.ОплатаЗаказа.Выбрать();
	КоличествоОплатЗаказов = 0;
	
	Пока Выборка.Следующий() Цикл

		Объект = Выборка.ПолучитьОбъект();
		
        Если Объект.Проведен Тогда
            Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
        КонецЕсли;		

		Объект.ОбменДанными.Загрузка = Истина; 
		Объект.Удалить();
		
		КоличествоОплатЗаказов = КоличествоОплатЗаказов + 1;

	КонецЦикла;

	Если Сообщать Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Очищено оплат заказов: " + КоличествоОплатЗаказов;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытий
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вернуть данные о клиенте.
// 
// Параметры:
//  СлучайныйКлиентИндекс - Число - Случайный клиент индекс
//  МассивКлиентов - Массив из Структура:
//  *Ссылка - СправочникСсылка.Клиенты
//  *Адрес - Строка
// 
// Возвращаемое значение:
//  Структура:
//  *Ссылка - СправочникСсылка.Клиенты
//  *Адрес - Строка
Функция ВернутьДанныеОКлиенте(Знач СлучайныйКлиентИндекс, МассивКлиентов)

	СлучайныйКлиент = МассивКлиентов[СлучайныйКлиентИндекс];
	Возврат СлучайныйКлиент

КонецФункции

#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли