
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура ЧекЗаказа(ТабДок, Ссылка) Экспорт

	Макет = ПолучитьМакет("ЧекЗаказа");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ Заказ.Номер,
		|	Заказ.Дата,
		|	Заказ.Курьер,
		|	Заказ.Транспорт,
		|	Заказ.Товар,
		|	Заказ.СуммаЗаказа
		|ИЗ
		|	Документ.Заказ КАК Заказ
		|ГДЕ
		|	Заказ.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПараметрыОбластиЗаголовка = Новый Структура;
		ПараметрыОбластиЗаголовка.Вставить("Номер", УдалитьНулиСлева(Выборка.Номер));
		ПараметрыОбластиЗаголовка.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=D;"));
		
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыОбластиЗаголовка);

		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытий
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УдалитьНулиСлева(НомерСНулями)
	
	Результат = НомерСНулями;
	
	Пока СтрНачинаетсяС(Результат, "0") Цикл
		Результат = Сред(Результат, 2);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли