// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Заказ.Номер КАК Номер,
		|	Заказ.Дата КАК Дата,
		|	Заказ.Клиент КАК Клиент,
		|	Заказ.Курьер КАК Курьер,
		|	Заказ.Транспорт КАК Транспорт,
		|	Заказ.Транспорт.СерийныйНомер КАК ТранспортСерийныйНомер,
		|	Заказ.Цена КАК Цена,
		|	Заказ.БаллыНаСписание КАК БаллыНаСписание,
		|	Заказ.СуммаЗаказа КАК СуммаЗаказа
		|ИЗ
		|	Документ.Заказ КАК Заказ
		|ГДЕ
		|	Заказ.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПозицииПродажиШапка = Макет.ПолучитьОбласть("ПозицииПродажиШапка");
	ОбластьПозицииПродажи = Макет.ПолучитьОбласть("ПозицииПродажи");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	Если Выборка.Следующий() Тогда
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПараметрыОбластиЗаголовка = Новый Структура;
		ПараметрыОбластиЗаголовка.Вставить("Номер", ОбщиеФункцииКлиентСервер.УдалитьНулиСлева(Выборка.Номер));
		ПараметрыОбластиЗаголовка.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=D;"));
		
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыОбластиЗаголовка);

		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьПозицииПродажиШапка);
		
		ЗапросПозицииПродажи = Новый Запрос;
		ЗапросПозицииПродажи.Текст =
			"ВЫБРАТЬ
			|	ЗаказПозицииПродажи.Ссылка КАК Ссылка,
			|	ЗаказПозицииПродажи.НомерСтроки КАК НомерСтроки,
			|	ЗаказПозицииПродажи.Товар КАК Товар,
			|	ЗаказПозицииПродажи.ЦенаЗаЕдиницу КАК ЦенаЗаЕдиницу,
			|	ЗаказПозицииПродажи.Количество КАК Количество,
			|	ЗаказПозицииПродажи.СуммаПозиции КАК СуммаПозиции
			|ИЗ
			|	Документ.Заказ.ПозицииПродажи КАК ЗаказПозицииПродажи
			|ГДЕ
			|	ЗаказПозицииПродажи.Ссылка В (&Ссылка)";
		ЗапросПозицииПродажи.Параметры.Вставить("Ссылка", Ссылка);
		
		ВыборкаПозицииПродажи = ЗапросПозицииПродажи.Выполнить().Выбрать();
		
		Пока ВыборкаПозицииПродажи.Следующий() Цикл
			
			ОбластьПозицииПродажи.Параметры.Заполнить(ВыборкаПозицииПродажи);
			ТабДок.Вывести(ОбластьПозицииПродажи, ВыборкаПозицииПродажи.Уровень());
			
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЕсли;

КонецПроцедуры

// Провести документы с бесценными товарами.
Процедура ПровестиДокументыСБесценнымиТоварами() Экспорт
	
	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Заказ.Номер КАК Номер,
//	|	Заказ.Ссылка КАК Ссылка,
//	|	Заказ.Проведен КАК Проведен
//	|ИЗ
//	|	Документ.Заказ КАК Заказ
//	|ГДЕ
//	|	Заказ.Ссылка В
//	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|			ЗаказПозицииПродажи.Ссылка
//	|		ИЗ
//	|			Документ.Заказ.ПозицииПродажи КАК ЗаказПозицииПродажи
//	|		ГДЕ
//	|			ЗаказПозицииПродажи.СуммаПозиции = 0
//	|			И ЗаказПозицииПродажи.Товар.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидНоменклатуры.Товар))";
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Заказ.Номер КАК Номер,
	|	Заказ.Ссылка КАК Ссылка,
	|	Заказ.Проведен КАК Проведен
	|ИЗ
	|	Документ.Заказ КАК Заказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ.ПозицииПродажи КАК ЗаказПозицииПродажи
	|		ПО Заказ.Ссылка = ЗаказПозицииПродажи.Ссылка
	|ГДЕ
	|	ЗаказПозицииПродажи.СуммаПозиции = 0
	|	И ЗаказПозицииПродажи.Товар.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидНоменклатуры.Товар)";
		
	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Найдено %1 заказов с бесценными товарами:", Выборка.Количество());
		Сообщение.Сообщить();
		
		Пока Выборка.Следующий() Цикл
			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			ПояснениеДляПользователя = ?(Выборка.Проведен, "Перепроведён", "Проведён впервые");
			
			Объект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("%1 - %2", Выборка.Номер, ПояснениеДляПользователя);
			Сообщение.Сообщить();

		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//#КонецОбласти

//#Область ОбработчикиСобытий
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

#КонецЕсли
