#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МаксимальнаяДоляОплатыБаллами = Константы.МаксимальнаяДоляОплатыБаллами.Получить();

	Если БаллыНаСписание <> 0 Тогда
		
		Если БаллыНаСписание > Цена Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Списываемые баллы превышают цену заказа";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Поле = "БаллыНаСписание";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Если Цена <> 0 Тогда
			
			ДоляБалловОтЦены = БаллыНаСписание / Цена * 100;
			ДопустимоеКоличествоБаллов = Цел(Цена * МаксимальнаяДоляОплатыБаллами / 100);
			
			Если ДоляБалловОтЦены > МаксимальнаяДоляОплатыБаллами Тогда
				
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Превышена максимальная доля баллов: %1%%. Для цены %2 максимальное число баллов: %3", МаксимальнаяДоляОплатыБаллами, Цена, ДопустимоеКоличествоБаллов);
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Поле = "БаллыНаСписание";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр НеоплаченныеЗаказы
	Движения.НеоплаченныеЗаказы.Записывать = Истина;
	Движение = Движения.НеоплаченныеЗаказы.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.ОснованиеПлатежа = Ссылка;
	Движение.Ответственный = Курьер;
	Движение.КоличествоНеоплаченныхЗаказов = 1;

	// регистр Продажи
	Движения.Продажи.Записывать = Истина;

	Для Каждого ТекСтрокаТовар из Товар Цикл

		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Товар = ТекСтрокаТовар.Товар;
		Движение.Сумма = ТекСтрокаТовар.СуммаПозиции;

	КонецЦикла;
	
	// регистр БонусныеБаллыКлиентов
	ОбработатьБонусныеБаллы(Отказ);
	
КонецПроцедуры

#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьБонусныеБаллы(Отказ)
		
	Движения.БонусныеБаллыКлиентов.Записывать = Истина;
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат;
	КонецЕсли;
	
	СуммаПокупокКлиента = ПолучитьСуммуПокупокКлиента();
	ДоляНакапливаемыхБалловКлиента = ПолучитьДолюНакапливаемыхБалловКлиента(СуммаПокупокКлиента);
	БаллыКНакоплению = СуммаЗаказа * ДоляНакапливаемыхБалловКлиента / 100;

	Если БаллыКНакоплению <> 0 Тогда
		
		Движение = Движения.БонусныеБаллыКлиентов.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.СуммаБаллов = БаллыКНакоплению;
		
	КонецЕсли;
	
	Если БаллыНаСписание <> 0 Тогда
		
		Движение = Движения.БонусныеБаллыКлиентов.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.СуммаБаллов = БаллыНаСписание;
		
	КонецЕсли;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БонусныеБаллыКлиентовОстатки.СуммаБалловОстаток КАК СуммаБалловОстаток
		|ИЗ
		|	РегистрНакопления.БонусныеБаллыКлиентов.Остатки(&Период, Клиент = &Клиент) КАК БонусныеБаллыКлиентовОстатки
		|ГДЕ
		|	БонусныеБаллыКлиентовОстатки.СуммаБалловОстаток < 0";
		Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Клиент", Клиент);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Доступно баллов к списанию: %1", Выборка.СуммаБалловОстаток + БаллыНаСписание);
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "БаллыНаСписание";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСуммуПокупокКлиента()

	 Запрос = Новый Запрос;
	 Запрос.Текст =
		 "ВЫБРАТЬ
		 |	ПродажиОбороты.СуммаОборот КАК СуммаОборот
		 |ИЗ
		 |	РегистрНакопления.Продажи.Обороты(, &КонецПериода,, Клиент = &Клиент) КАК ПродажиОбороты";
	 Запрос.УстановитьПараметр("КонецПериода", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	 Запрос.УстановитьПараметр("Клиент", Клиент);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Если Выборка.Следующий() Тогда

	 	Возврат Выборка.СуммаОборот;
	 	
	 Иначе
	 	
	 	Возврат 0;
	 
	 КонецЕсли;
	
КонецФункции

Функция ПолучитьДолюНакапливаемыхБалловКлиента(СуммаПокупокКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШкалаБонусовДиапазоны.ПроцентНакопления КАК ПроцентНакопления
		|ИЗ
		|	РегистрСведений.ШкалаБонусов.СрезПоследних(&Период,) КАК ШкалаБонусовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ШкалаБонусов.Диапазоны КАК ШкалаБонусовДиапазоны
		|		ПО ШкалаБонусовСрезПоследних.Шкала = ШкалаБонусовДиапазоны.Ссылка
		|ГДЕ
		|	ШкалаБонусовДиапазоны.НижняяГраница <= &СуммаПокупокКлиента
		|	И (ШкалаБонусовДиапазоны.ВерхняяГраница > &СуммаПокупокКлиента
		|	ИЛИ ШкалаБонусовДиапазоны.ВерхняяГраница = 0)";
	Запрос.УстановитьПараметр("СуммаПокупокКлиента", СуммаПокупокКлиента);
	Запрос.УстановитьПараметр("Период", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ПроцентНакопления;
	
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
