#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр НеоплаченныеЗаказы
	Движения.НеоплаченныеЗаказы.Записывать = Истина;
	Движение = Движения.НеоплаченныеЗаказы.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.ОснованиеПлатежа = Ссылка;
	Движение.Ответственный = Курьер;
	Движение.КоличествоНеоплаченныхЗаказов = 1;

	// регистр Продажи
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.Товар = Товар;
	Движение.Сумма = СуммаЗаказа;

КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
