// @strict-types

#Область ПрограммныйИнтерфейс

// Нормализовать номер телефона.
// 
// Параметры:
//  СыройТелефон - Строка - номер со спецсимволами. Например:
//  +375(29)123-45-67
//  +7(495)123-45-67
//  +850(123)456-7890
//  +98(123)456-7890
//  +53(123)456-7890
//  +82(123)456-7890.
// 
// Возвращаемое значение:
//  Строка - нормализованный телефон только из цифр: 375291234567
Функция НормализоватьНомерТелефона(СыройТелефон) Экспорт
	
	ДопустимыеКоды = ПолучитьДопустимыеКоды();
	
	ОтфильтрованныеЦифры = ОтфильтроватьЦифры(СыройТелефон);
	ЭтоДопустимыйКод = ПроверитьДопустимыеКодыТелефона(ОтфильтрованныеЦифры, ДопустимыеКоды);
	
	Если ЭтоДопустимыйКод Тогда
		
		Возврат ОтфильтрованныеЦифры;
		
	Иначе
		
		ТекстОшибки = СоставитьСообщениеОНеверномКодеТелефона(ДопустимыеКоды);
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецФункции

// Получить допустимые коды.
// 
// Возвращаемое значение:
//  Структура:
//  * Беларусь - Строка
//  * Россия - Строка
//  * КНДР - Строка
//  * Иран - Строка
//  * Куба - Строка
Функция ПолучитьДопустимыеКоды() Экспорт

	ДопустимыеКоды = Новый Структура;
	ДопустимыеКоды.Вставить("Беларусь", "375");
	ДопустимыеКоды.Вставить("Россия", "7");
	ДопустимыеКоды.Вставить("КНДР", "850");
	ДопустимыеКоды.Вставить("Иран", "98");
	ДопустимыеКоды.Вставить("Куба", "53");
	Возврат ДопустимыеКоды;
	
КонецФункции

// Обрезать дробную часть до двух знаков.
// 
// Параметры:
//  ДробноеЧисло - Число
// 
// Возвращаемое значение:
//  Число - С 2 знаками после запятой. Например: 5,987 => 5,98
Функция ОбрезатьДробнуюЧастьДоДвухЗнаков(ДробноеЧисло) Экспорт
	Возврат Цел(ДробноеЧисло * 100) / 100;
КонецФункции

// Обрезать дробную часть.
// 
// Параметры:
//  ДробноеЧисло - Число
//  ЗнаковПослеЗапятой - Число
// 
// Возвращаемое значение:
//  Число
Функция ОбрезатьДробнуюЧасть(ДробноеЧисло, ЗнаковПослеЗапятой) Экспорт
	
	Точность = Pow(10, ЗнаковПослеЗапятой);
	Возврат Цел(ДробноеЧисло * Точность) / Точность;
	
КонецФункции

// Удалить нули слева.
// 
// Параметры:
//  НомерСНулями - Строка
// 
// Возвращаемое значение:
//  Строка
Функция УдалитьНулиСлева(НомерСНулями) Экспорт
	
	Результат = НомерСНулями;
	
	Пока СтрНачинаетсяС(Результат, "0") Цикл
		Результат = Сред(Результат, 2);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Вернуть количество секунд в сутках.
// 
// Возвращаемое значение:
//  Число - Вернуть количество секунд в сутках
Функция ВернутьКоличествоСекундВСутках() Экспорт
	Возврат 86400;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтфильтроватьЦифры(СтрокаСЦифрами)
	
	Цифры = "0123456789";
	ОтфильтрованныеЦифры = "";
	
	Для Счётчик = 1 По СтрДлина(СтрокаСЦифрами) Цикл
	
		Символ = Сред(СтрокаСЦифрами, Счётчик, 1);
		
		Если СтрНайти(Цифры, Символ) <> 0 Тогда
			
			ОтфильтрованныеЦифры = ОтфильтрованныеЦифры + Символ;
			
		Иначе
			
			Продолжить;

		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ОтфильтрованныеЦифры;
	
КонецФункции

Функция ПроверитьДопустимыеКодыТелефона(ПроверяемыйТелефон, ДопустимыеКоды)
	
	ЭтоДопустимыйКод = Ложь;
	
	Для Каждого Код Из ДопустимыеКоды Цикл
		
//		Страна = Код.Ключ;
		ТелефонныйКод = Код.Значение;
		
		Если СтрНачинаетсяС(ПроверяемыйТелефон, Строка(ТелефонныйКод)) Тогда
			
			ЭтоДопустимыйКод = Истина;
			Прервать
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЭтоДопустимыйКод;
	
КонецФункции

Функция СоставитьСообщениеОНеверномКодеТелефона(ДопустимыеКоды)
	
	Сообщение = Символы.ПС + Символы.ПС + "Неподдерживаемый код страны. Допустимые коды:" + Символы.ПС;
	
	Для Каждого Код Из ДопустимыеКоды Цикл

		Страна = Код.Ключ;
		ТелефонныйКод = Код.Значение;
		Сообщение = Сообщение + Страна + ": " + ТелефонныйКод + Символы.ПС;

	КонецЦикла;
	
	Возврат Сообщение;
	
КонецФункции

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти