#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		НормализованныйТелефон = ОбщийМодульКлиентСервер.НормализоватьНомерТелефона(Телефон);
		Телефон = НормализованныйТелефон;
		
	Исключение
		
		Отказ = Истина;
		
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
