
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	НомерУдаляемогоРеквизита = ПроверяемыеРеквизиты.Найти("КоличествоЗаказов");
	
	Если ВидНоменклатуры <> Перечисления.ВидНоменклатуры.ДоставкаЗаказов Тогда
		
		Если НомерУдаляемогоРеквизита <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерУдаляемогоРеквизита);
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли