// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	НомерУдаляемогоРеквизита = ПроверяемыеРеквизиты.Найти("КоличествоЗаказов");
	
	Если ВидНоменклатуры <> Перечисления.ВидНоменклатуры.Услуга Тогда
		
		Если НомерУдаляемогоРеквизита <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерУдаляемогоРеквизита);
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли