#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)

	ПользовательИнформационнойБазы = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПользовательСправочник = Справочники.Пользователи.НайтиПоРеквизиту(
		"ИдентификаторПользователяИБ",
		ПользовательИнформационнойБазы.УникальныйИдентификатор
	);
	
	ПараметрыСеанса.ТекущийПользователь = ПользовательСправочник;
	
	Если Не ЗначениеЗаполнено(ПользовательСправочник) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(
			"Пользователь %1 не найден в справочнике пользователей",
			ПользовательИнформационнойБазы.Имя
		);
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти