#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр НеоплаченныеЗаказы
	Движения.НеоплаченныеЗаказы.Записывать = Истина;
	Движение = Движения.НеоплаченныеЗаказы.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.ОснованиеПлатежа = Заказ;
	Движение.Ответственный = Курьер;
	Движение.КоличествоНеоплаченныхЗаказов = 1;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НеоплаченныеЗаказыОстатки.ОснованиеПлатежа КАК ОснованиеПлатежа
		|ИЗ
		|	РегистрНакопления.НеоплаченныеЗаказы.Остатки(, ОснованиеПлатежа = &ОснованиеПлатежа) КАК НеоплаченныеЗаказыОстатки
		|ГДЕ
		|	НеоплаченныеЗаказыОстатки.КоличествоНеоплаченныхЗаказовОстаток < 0";
	Запрос.УстановитьПараметр("ОснованиеПлатежа", Заказ);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заказ уже оплачен.";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Заказ";
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
