// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ДоставкиИОплаты
	Движения.ДоставкиИОплаты.Записывать = Истина;
	ДвижениеНеоплаченныеЗаказы = Движения.ДоставкиИОплаты.Добавить();
	ДвижениеНеоплаченныеЗаказы.Период = Дата;
	ДвижениеНеоплаченныеЗаказы.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвижениеНеоплаченныеЗаказы.ОснованиеПлатежа = Заказ;
	ДвижениеНеоплаченныеЗаказы.Ответственный = Курьер;
	ДвижениеНеоплаченныеЗаказы.КоличествоНеоплаченныхЗаказов = 1;
	ДвижениеНеоплаченныеЗаказы.НеоплаченнаяСуммаЗаказов = СуммаЗаказа;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НеоплаченныеЗаказыОстатки.ОснованиеПлатежа КАК ОснованиеПлатежа
		|ИЗ
		|	РегистрНакопления.ДоставкиИОплаты.Остатки(, ОснованиеПлатежа = &ОснованиеПлатежа) КАК НеоплаченныеЗаказыОстатки
		|ГДЕ
		|	НеоплаченныеЗаказыОстатки.КоличествоНеоплаченныхЗаказовОстаток < 0";
	Запрос.УстановитьПараметр("ОснованиеПлатежа", Заказ);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заказ уже оплачен.";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Заказ";
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
