// @strict-types

#Область ПрограммныйИнтерфейс

// Позиции продажи товар при изменении.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ЭтотОбъект
//  ДанныеФормы - ДанныеФормыСтруктура - Объект
//  Таблица - ДанныеФормыКоллекция из ДанныеФормыЭлементКоллекции:
//	  * Товар - СправочникСсылка.Номенклатура
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции:
//	  * Товар - СправочникСсылка.Номенклатура
//    * ЦенаЗаЕдиницу - Число
//    * Количество - Число
Процедура ТоварПриИзменении(Форма, ДанныеФормы, Таблица, ТекущаяСтрока) Экспорт
	
	ДатаВремяЗаказа = Дата("00010101");
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Товар) Тогда
		
		Для Каждого Строка Из Таблица Цикл
			
			Если Строка <> ТекущаяСтрока И Строка.Товар = ТекущаяСтрока.Товар Тогда

				ИндексСтрокиДляУдаления = Неопределено;
				
				Для Сч = 0 По Таблица.Количество() - 1 Цикл
					
					Если Таблица.Получить(Сч) = ТекущаяСтрока Тогда
						
						ИндексСтрокиДляУдаления = Сч;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ИндексСтрокиДляУдаления <> Неопределено Тогда
					
					ПредупреждениеОДубликате(Таблица, ИндексСтрокиДляУдаления);
					Возврат;
					
				КонецЕсли;

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	КоличествоПоУмолчанию = 1;

	// Когда форма Документа
	ЭтоДатаВремяЗаказа = ДанныеФормы.Свойство("Дата", ДатаВремяЗаказа);

	// Когда форма Обработки
	Если ЭтоДатаВремяЗаказа = Ложь Тогда
		ДатаВремяЗаказа = ОбщийМодульВызовСервера.ПолучитьТекущуюДату();
	КонецЕсли;

	ДатаЗаказа = НачалоДня(ДатаВремяЗаказа);
	ВыбраннаяНоменклатура = ТекущаяСтрока.Товар;

	Если Не ЗначениеЗаполнено(ВыбраннаяНоменклатура) Тогда
		
		ТекущаяСтрока.ЦенаЗаЕдиницу = 0;
		ТекущаяСтрока.Количество = 0;
		
		ПосчитатьИЗаписатьСуммуПозиции(ТекущаяСтрока);
		ПосчитатьИЗаписатьЗаказ(Форма, ДанныеФормы, Таблица);
		
		Возврат;
		
	КонецЕсли;
	
	Ответ = ОбщийМодульВызовСервера.ПолучитьЦенуИВидНоменклатуры(ДатаЗаказа, ВыбраннаяНоменклатура);
	Цена = Ответ.Цена;
	Вид = Ответ.ИмяВидаНоменклатуры;

	Если Не ЗначениеЗаполнено(Цена) И (Вид = "Товар") Тогда
		СообщитьОНулевойЦене();
	КонецЕсли;
	
	ТекущаяСтрока.ЦенаЗаЕдиницу = Цена;
	ТекущаяСтрока.Количество = КоличествоПоУмолчанию;
	
	ПосчитатьИЗаписатьСуммуПозиции(ТекущаяСтрока);
	ПосчитатьИЗаписатьЗаказ(Форма, ДанныеФормы, Таблица);

КонецПроцедуры

// Посчитать и записать заказ.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ЭтотОбъект:
//    * ПроцентНакопления - Число
//    * Цена - Число
//    * СуммаБалловОстаток - Число
//    * БаллыКНакоплению - Число
//    * МаксимальнаяДоляОплатыБаллами - Число
//    * Клиент - СправочникСсылка.Клиенты
//  ДанныеФормы - ДанныеФормыСтруктура - Объект:
//    * Цена - Число
//    * Клиент - СправочникСсылка.Клиенты
//  Таблица - ДанныеФормыКоллекция
//  СуммаБалловОстаток - Число
Процедура ПосчитатьИЗаписатьЗаказ(Форма, ДанныеФормы, Таблица) Экспорт
	
	ОбъектСВидимымиПолями = Неопределено;
	
	// Когда форма Документа
	Если ДанныеФормы.Свойство("СуммаЗаказа") Тогда
		ОбъектСВидимымиПолями = ДанныеФормы;
	// Когда форма Обработки
	Иначе
		ОбъектСВидимымиПолями = Форма;
	КонецЕсли;
	
	ПосчитатьИЗаписатьЦенуЗаказа(ОбъектСВидимымиПолями, Таблица);
	ПосчитатьИЗаписатьСуммуЗаказа(ОбъектСВидимымиПолями);
	
	ПосчитатьИЗаписатьБаллыКНакоплению(
		Форма,
		Форма.ПроцентНакопления,
		ОбъектСВидимымиПолями.Цена
	);
	
	Если Не ЗначениеЗаполнено(ОбъектСВидимымиПолями.Клиент) Тогда
		Возврат;
	КонецЕсли;

	ВывестиСообщениеОБаллах(
		ОбъектСВидимымиПолями.Цена,
		Форма.СуммаБалловОстаток,
		Форма.БаллыКНакоплению,
		Форма.МаксимальнаяДоляОплатыБаллами,
		Форма.Элементы.ДекорацияБаллыКлиента
	);

КонецПроцедуры

// Посчитать и записать сумму позиции.
// 
// Параметры:
//  Строка - ДанныеФормыЭлементКоллекции:
//    * СуммаПозиции - Число
Процедура ПосчитатьИЗаписатьСуммуПозиции(Строка) Экспорт
	
	Строка.СуммаПозиции = Строка.ЦенаЗаЕдиницу * Строка.Количество;
	
КонецПроцедуры

// Клиент при изменении.
// 
// Параметры:
//  ОбъектСсылка - ДокументСсылка.Заказ
//  Форма - ФормаКлиентскогоПриложения - ЭтотОбъект:
//    * ПроцентНакопления - Число
//    * СуммаБалловОстаток - Число
//    * БаллыКНакоплению - Число
//  ДанныеФормы - ДанныеФормыСтруктура - Объект:
//    * Адрес - Строка
//  ДатаЗаказа - Дата
//  Цена - Число - Цена для проверяемого заказа до скидки
//  Клиент - СправочникСсылка.Клиенты
//  МаксимальнаяДоляОплатыБаллами - Число
Процедура ПолучитьБаллыИПоказатьИнформацию(
		ОбъектСсылка,
		Форма,
		ДанныеФормы,
		ДатаЗаказа,
		Цена,
		Клиент,
		МаксимальнаяДоляОплатыБаллами
	) Экспорт

	Декорация = Форма.Элементы.ДекорацияБаллыКлиента; // ДекорацияФормы

	Если Не ЗначениеЗаполнено(Клиент) Тогда

		Декорация.Видимость = Ложь;
		
		Форма.СуммаБалловОстаток = 0;
		Форма.ПроцентНакопления = 0;
		Форма.БаллыКНакоплению = 0;
	
		Возврат;
		
	КонецЕсли;

	ИнформацияОКлиенте = ОбщийМодульВызовСервера.ПолучитьИнформациюОКлиенте(
		ОбъектСсылка,
		ДатаЗаказа,
		Клиент,
		Цена
	);
	Форма.СуммаБалловОстаток = ИнформацияОКлиенте.СуммаБалловОстаток;
	Форма.ПроцентНакопления = ИнформацияОКлиенте.ПроцентНакопления;
	Форма.БаллыКНакоплению = ИнформацияОКлиенте.БаллыКНакоплению;
	
	ОбъектСВидимымиПолями = Неопределено;
	
	// Когда форма Документа
	Если ДанныеФормы.Свойство("Адрес") Тогда
		ОбъектСВидимымиПолями = ДанныеФормы;
	// Когда форма Обработки
	Иначе
		ОбъектСВидимымиПолями = Форма;
	КонецЕсли;
	
	ОбъектСВидимымиПолями.Адрес = ИнформацияОКлиенте.Адрес;
	
	ВывестиСообщениеОБаллах(
		Цена,
		Форма.СуммаБалловОстаток,
		Форма.БаллыКНакоплению,
		МаксимальнаяДоляОплатыБаллами,
		Декорация
	);
	
КонецПроцедуры

// Вывести сообщение о баллах.
// 
// Параметры:
//  Цена - Число - Цена
//  СуммаБалловОстаток - Число
//  БаллыКНакоплению - Число
//  МаксимальнаяДоляОплатыБаллами - Число - Максимальная доля оплаты баллами
//  Декорация - ДекорацияФормы - Декорация
Процедура ВывестиСообщениеОБаллах(
	Цена,
	СуммаБалловОстаток,
	БаллыКНакоплению,
	МаксимальнаяДоляОплатыБаллами,
	Декорация
) Экспорт
	
	СообщениеОБаллах = СоставитьСообщениеОБаллах(
		Цена,
		СуммаБалловОстаток,
		БаллыКНакоплению,
		МаксимальнаяДоляОплатыБаллами
	);
	
	Декорация.Видимость = Истина;
	Декорация.Заголовок = СообщениеОБаллах;
	
КонецПроцедуры

// Получить шаблон ссылка заполнитель.
// 
// Возвращаемое значение:
//  Строка - Получить шаблон ссылка заполнитель
Функция ПолучитьШаблонСсылкаЗаполнитель() Экспорт
	Возврат "#Заполнить_";
КонецФункции

// Предупреждение о дубликате.
// 
// Параметры: ОпциональнаяПроцедура - Неопределено - Опциональная процедура
//  Таблица - ДанныеФормыКоллекция
//  Индекс - Число
Процедура ПредупреждениеОДубликате(Таблица = Неопределено, Индекс = Неопределено) Экспорт
	
	ПоказатьПредупреждение(, "Такой товар уже добавлен в заказ");
	
	Если ЗначениеЗаполнено(Таблица) И ЗначениеЗаполнено(Индекс) Тогда
		Таблица.Удалить(Индекс);
	КонецЕсли;
	
КонецПроцедуры

// Вывести одномерную структуру для отладки
// 
// Параметры:
//  Структура - Структура
Процедура ВывестиСтруктуру(Структура) Экспорт

	СтрокаСтруктуры = "";
	
	Для Каждого Свойство Из Структура Цикл
		СтрокаСтруктуры = СтрокаСтруктуры + Свойство.Ключ + ": " + Строка(Свойство.Значение) + Символы.ПС;
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = СтрокаСтруктуры;
	Сообщение.Сообщить();

КонецПроцедуры

// Баллы обработка ссылки.
// 
// Параметры:
//  ОбъектДляЗаполнения - ФормаКлиентскогоПриложения
//  БаллыНаСписание - Число
//  Элемент - ДекорацияФормы
//  НавигационнаяСсылкаФорматированнойСтроки - Строка
//  СтандартнаяОбработка - Булево
Процедура БаллыОбработкаСсылки(
		ОбъектДляЗаполнения,
		БаллыНаСписание,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка
	) Экспорт
	
	ШаблонСсылкаЗаполнитель = ПолучитьШаблонСсылкаЗаполнитель();

	Если СтрНачинаетсяС(НавигационнаяСсылкаФорматированнойСтроки, ШаблонСсылкаЗаполнитель) Тогда
		
		СтандартнаяОбработка = Ложь;
		БаллыНаСписание = Число(
			СтрЗаменить(НавигационнаяСсылкаФорматированнойСтроки, ШаблонСсылкаЗаполнитель, "")
		);
		
		ПосчитатьИЗаписатьСуммуЗаказа(ОбъектДляЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

// Избранные нажатие.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ЭтотОбъект
//  ДанныеФормы - ДанныеФормыСтруктура - Объект
//  ТабличнаяЧасть - ДанныеФормыКоллекция
//  Элемент - ДекорацияФормы
//  КоллекцияИзбранного - ДанныеФормыКоллекция из ДанныеФормыЭлементКоллекции:
//    * Номенклатура - СправочникСсылка.Номенклатура
//    * Цена - Число
Процедура ИзбранныеНажатие(Форма, ДанныеФормы, ТабличнаяЧасть, Элемент, КоллекцияИзбранного) Экспорт

	Фильтр = Новый Структура("ИмяЭлемента", Элемент.Имя);
	НайденныеСтроки = КоллекцияИзбранного.НайтиСтроки(Фильтр);
	
	Если НайденныеСтроки.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Строка = НайденныеСтроки[0];
	
	ДобавитьУникальнуюПозицию(Форма, ДанныеФормы, ТабличнаяЧасть, Строка.Номенклатура, Строка.Цена);
	
КонецПроцедуры

// Добавить уникальную позицию.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - ЭтотОбъект
//  ДанныеФормы - ДанныеФормыСтруктура - Объект
//  ТабличнаяЧасть - ДанныеФормыКоллекция из ДанныеФормыЭлементКоллекции:
//    * Товар - СправочникСсылка.Номенклатура
//    * ЦенаЗаЕдиницу - Число
//    * Количество - Число
//    * СуммаПозиции - Число
//  Номенклатура - СправочникСсылка.Номенклатура
//  Цена - Число
Процедура ДобавитьУникальнуюПозицию(Форма, ДанныеФормы, ТабличнаяЧасть, Номенклатура, Цена) Экспорт
	
	ФильтрПозицийПродаж = Новый Структура;
	ФильтрПозицийПродаж.Вставить("Товар", Номенклатура);
	
	ОтфильтрованныеСтроки = ТабличнаяЧасть.НайтиСтроки(ФильтрПозицийПродаж);
	
	Если ОтфильтрованныеСтроки.Количество() > 0 Тогда
		
		ПредупреждениеОДубликате();
		Возврат;
		
	КонецЕсли;
	
	ДобавляемаяСтрока = ТабличнаяЧасть.Добавить();
	ДобавляемаяСтрока.Товар = Номенклатура;
	ДобавляемаяСтрока.ЦенаЗаЕдиницу = Цена;
	ДобавляемаяСтрока.Количество = 1;
	ДобавляемаяСтрока.СуммаПозиции = Цена;
	
	ПосчитатьИЗаписатьЗаказ(Форма, ДанныеФормы, ТабличнаяЧасть);
	
КонецПроцедуры

// Сообщить о нулевой цене.
Процедура СообщитьОНулевойЦене() Экспорт

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Нулевая цена товара. Проверьте установку цены в соответствующем документе";
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Посчитать и записать цену заказа.
// 
// Параметры:
//  ОбъектДляЗаполнения - ДанныеФормыСтруктура, ФормаКлиентскогоПриложения - Объект для заполнения:
// * ПроцентНакопления - Число
// * Цена - Число
// * СуммаБалловОстаток - Число
// * БаллыКНакоплению - Число
// * МаксимальнаяДоляОплатыБаллами - Число
// * Клиент - СправочникСсылка.Клиенты
//  Таблица - ДанныеФормыКоллекция из ДанныеФормыЭлементКоллекции:
// * Товар - СправочникСсылка.Номенклатура
// * ЦенаЗаЕдиницу - Число
Процедура ПосчитатьИЗаписатьЦенуЗаказа(ОбъектДляЗаполнения, Таблица)

	Цена = 0;
	
	Для Каждого Строка Из Таблица Цикл

		Цена = Цена + Строка.СуммаПозиции;
		
	КонецЦикла;
	
	ОбъектДляЗаполнения.Цена = Цена;
	
КонецПроцедуры

// Посчитать и записать сумму заказа.
// 
// Параметры:
//  ОбъектДляЗаполнения - ФормаКлиентскогоПриложения, ДанныеФормыСтруктура - Объект для заполнения:
// * СуммаЗаказа - Число
// * БаллыНаСписание - Число
Процедура ПосчитатьИЗаписатьСуммуЗаказа(ОбъектДляЗаполнения)
	
	ОбъектДляЗаполнения.СуммаЗаказа = ОбъектДляЗаполнения.Цена - ОбъектДляЗаполнения.БаллыНаСписание;
	
КонецПроцедуры

Процедура ПосчитатьИЗаписатьБаллыКНакоплению(ОбъектДляЗаполнения, ПроцентНакопления, Цена)
	
	БаллыКНакоплению = ОбщийМодульВызовСервера.ПолучитьБаллыКНакоплениюЧерезПроцент(
		ПроцентНакопления,
		Цена
	);
	
	ОбъектДляЗаполнения.БаллыКНакоплению = БаллыКНакоплению;
	
КонецПроцедуры

Функция СоставитьСообщениеОБаллах(
	Цена,
	СуммаБалловОстаток,
	БаллыКНакоплению,
	МаксимальнаяДоляОплатыБаллами
)
	
	СтарыеИНовыеБаллы = СуммаБалловОстаток + БаллыКНакоплению;
	МаксимальнаяДоляОплатыБалламиДляЭтогоЗаказа = Цена * МаксимальнаяДоляОплатыБаллами / 100;
	МаксимальнаяДоляДваЗнака = ОбщиеФункцииКлиентСервер.ОбрезатьДробнуюЧастьДоДвухЗнаков(
		МаксимальнаяДоляОплатыБалламиДляЭтогоЗаказа
	);
	
	МожноСписатьКоличество = Мин(СтарыеИНовыеБаллы, МаксимальнаяДоляДваЗнака);

	ШаблонИнформационноеСообщение =
		"Накоплено баллов ранее: %1. С учётом этого заказа: %2. Из них можно списать: %3. ";
	ИнформационноеСообщение = СтрШаблон(
		ШаблонИнформационноеСообщение,
//		ЧЦ — Число Цифр (общая длина)
//		ЧДЦ — Число Десятичных Знаков (знаков после запятой)
//		ЧГ — Числовые Группировки (0 — отключить)
//		ЧН — Число для нулевого значения
		Формат(СуммаБалловОстаток, "ЧЦ=15; ЧДЦ=2; ЧГ=0; ЧН=0,00"),
		Формат(СтарыеИНовыеБаллы, "ЧЦ=15; ЧДЦ=2; ЧГ=0; ЧН=0,00"),
		Формат(МожноСписатьКоличество, "ЧЦ=15; ЧДЦ=2; ЧГ=0; ЧН=0,00")
	);
	
	ШаблонСсылкаЗаполнитель = ПолучитьШаблонСсылкаЗаполнитель();
//	XMLСтрока() - для сервера
//	СсылкаЗаполнитель = СтрШаблон(ШаблонСсылкаЗаполнитель + "%1", XMLСтрока(МожноСписатьКоличество));
	СсылкаЗаполнитель = СтрШаблон(
		ШаблонСсылкаЗаполнитель + "%1",
		Формат(МожноСписатьКоличество, "ЧЦ=15; ЧДЦ=2; ЧГ=0; ЧН=0,00")
	);
	
	ЧастиФорматированнойСтроки = Новый Массив; // Массив из Строка
	ЧастиФорматированнойСтроки.Добавить(ИнформационноеСообщение);
	ЧастиФорматированнойСтроки.Добавить(
		Новый ФорматированнаяСтрока("Заполнить.", , , , СсылкаЗаполнитель)
	);
	
	ФорматированнаяСтрока = Новый ФорматированнаяСтрока(ЧастиФорматированнойСтроки);
	
	Возврат ФорматированнаяСтрока;
	
КонецФункции

#КонецОбласти