// @strict-types

//#Область ОписаниеПеременных
//
//#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	КонецПериода = ТекущаяДатаСеанса();
	НачалоМесяца = НачалоМесяца(КонецПериода);
	НачалоМесяцаПлюсНеделя = НачалоМесяца + (3600 * 24 * 6);
	ПериодЗначение = Новый СтандартныйПериод(НачалоМесяца, Мин(НачалоМесяцаПлюсНеделя, КонецПериода));
	Объект.Период = ПериодЗначение;
	
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы
//
//#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ГенерироватьТестовыеДанные(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ГенерироватьТестовыеДанныеНаСервере();
	ОповеститьТестовыеДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТестовыеДанные(Команда)
	
	ОчиститьТестовыеДанныеНаСервере();
	ОповеститьТестовыеДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ГенерироватьКлиентов(Команда)
	
	ГенерироватьКлиентовНаСервере();
	Оповестить("ОбновитьФормыСпискаКлиентов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКлиентов(Команда)
	
	ОчиститьКлиентовНаСервере();
	Оповестить("ОбновитьФормыСпискаКлиентов");
	
КонецПроцедуры

&НаКлиенте
Процедура ГенерироватьНоменклатуру(Команда)
	
	ГенерироватьНоменклатуруНаСервере();
	Оповестить("ОбновитьФормыСпискаКухонь");
	Оповестить("ОбновитьФормыСпискаНоменклатуры");
	Оповестить("ОбновитьФормыСпискаЦен");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНоменклатуру(Команда)
	
	ОчиститьНоменклатуруНаСервере();
	Оповестить("ОбновитьФормыСпискаНоменклатуры");
	
КонецПроцедуры

&НаКлиенте
Процедура ГенерироватьКурьеров(Команда)
	
	ГенерироватьКурьеровНаСервере();
	Оповестить("ОбновитьФормыСпискаКурьеров");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКурьеров(Команда)
	
	ОчиститьКурьеровНаСервере();
	Оповестить("ОбновитьФормыСпискаКурьеров");
	
КонецПроцедуры

&НаКлиенте
Процедура ГенерироватьВелосипеды(Команда)
	
	ГенерироватьВелосипедыНаСервере();
	Оповестить("ОбновитьФормыСпискаВелосипедов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВелосипеды(Команда)
	
	ОчиститьВелосипедыНаСервере();
	Оповестить("ОбновитьФормыСпискаВелосипедов");
	
КонецПроцедуры

&НаКлиенте
Процедура ГенерироватьЦены(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	ГенерироватьЦеныНаСервере();
	Оповестить("ОбновитьФормыСпискаКухонь");
	Оповестить("ОбновитьФормыСпискаНоменклатуры");
	Оповестить("ОбновитьФормыСпискаЦен");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЦены(Команда)
	
	ОчиститьЦеныНаСервере();
	Оповестить("ОбновитьФормыСпискаЦен");
	
КонецПроцедуры

&НаКлиенте
Процедура ГенерироватьШкалыБонусов(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ГенерироватьШкалыБонусовНаСервере();
	Оповестить("ОбновитьФормыСпискаШкалБонусов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьШкалыБонусов(Команда)
	
	ОчиститьШкалыБонусовНаСервере();
	Оповестить("ОбновитьФормыСпискаШкалБонусов");
	
КонецПроцедуры

&НаКлиенте
Процедура ГенерироватьЗаказы(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ГенерироватьЗаказыНаСервере();
	Оповестить("ОбновитьФормыСпискаКлиентов");
	Оповестить("ОбновитьФормыСпискаКухонь");
	Оповестить("ОбновитьФормыСпискаНоменклатуры");
	Оповестить("ОбновитьФормыСпискаКурьеров");
	Оповестить("ОбновитьФормыСпискаВелосипедов");
	Оповестить("ОбновитьФормыСпискаЦен");
	Оповестить("ОбновитьФормыСпискаШкалБонусов");
	Оповестить("ОбновитьФормыСпискаЗаказов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗаказы(Команда)
	
	ОчиститьЗаказыНаСервере();
	Оповестить("ОбновитьФормыСпискаЗаказов");
	
КонецПроцедуры

&НаКлиенте
Процедура ГенерироватьОплатыЗаказов(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ГенерироватьОплатыЗаказовНаСервере();
	Оповестить("ОбновитьФормыСпискаКлиентов");
	Оповестить("ОбновитьФормыСпискаКухонь");
	Оповестить("ОбновитьФормыСпискаНоменклатуры");
	Оповестить("ОбновитьФормыСпискаКурьеров");
	Оповестить("ОбновитьФормыСпискаВелосипедов");
	Оповестить("ОбновитьФормыСпискаЦен");
	Оповестить("ОбновитьФормыСпискаШкалБонусов");
	Оповестить("ОбновитьФормыСпискаЗаказов");
	Оповестить("ОбновитьФормыСпискаОплатЗаказов");

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОплатыЗаказов(Команда)
	
	ОчиститьОплатыЗаказовНаСервере();
	Оповестить("ОбновитьФормыСпискаОплатЗаказов");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьОбъектОбработки()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции

&НаКлиенте
Процедура ОповеститьТестовыеДанные()
	
	Оповестить("ОбновитьФормыСпискаКлиентов");
	Оповестить("ОбновитьФормыСпискаКухонь");
	Оповестить("ОбновитьФормыСпискаНоменклатуры");
	Оповестить("ОбновитьФормыСпискаКурьеров");
	Оповестить("ОбновитьФормыСпискаВелосипедов");
	Оповестить("ОбновитьФормыСпискаЦен");
	Оповестить("ОбновитьФормыСпискаШкалБонусов");
	Оповестить("ОбновитьФормыСпискаЗаказов");
	Оповестить("ОбновитьФормыСпискаОплатЗаказов");
	
КонецПроцедуры

&НаСервере
Процедура ГенерироватьТестовыеДанныеНаСервере()
	ПолучитьОбъектОбработки().ГенерироватьТестовыеДанные();
КонецПроцедуры

&НаСервере
Процедура ОчиститьТестовыеДанныеНаСервере()
	ПолучитьОбъектОбработки().ОчиститьТестовыеДанные();
КонецПроцедуры

&НаСервере
Процедура ГенерироватьКлиентовНаСервере()
	ПолучитьОбъектОбработки().ГенерироватьКлиентов(Истина);
КонецПроцедуры

&НаСервере
Процедура ОчиститьКлиентовНаСервере()
	ПолучитьОбъектОбработки().ОчиститьКлиентов(Истина);
КонецПроцедуры

&НаСервере
Процедура ГенерироватьНоменклатуруНаСервере()
	
	ПолучитьОбъектОбработки().ГенерироватьВидыКухни();
	ПолучитьОбъектОбработки().ГенерироватьНоменклатуру(Истина);
	ПолучитьОбъектОбработки().ГенерироватьЦены();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНоменклатуруНаСервере()
	ПолучитьОбъектОбработки().ОчиститьНоменклатуру(Истина);
КонецПроцедуры

&НаСервере
Процедура ГенерироватьКурьеровНаСервере()
	ПолучитьОбъектОбработки().ГенерироватьКурьеров(Истина);
КонецПроцедуры

&НаСервере
Процедура ОчиститьКурьеровНаСервере()
	ПолучитьОбъектОбработки().ОчиститьКурьеров(Истина);
КонецПроцедуры

&НаСервере
Процедура ГенерироватьВелосипедыНаСервере()
	ПолучитьОбъектОбработки().ГенерироватьВелосипеды(Истина);
КонецПроцедуры

&НаСервере
Процедура ОчиститьВелосипедыНаСервере()
	ПолучитьОбъектОбработки().ОчиститьВелосипеды(Истина);
КонецПроцедуры

&НаСервере
Процедура ГенерироватьЦеныНаСервере()
	
	ПолучитьОбъектОбработки().ГенерироватьВидыКухни();
	ПолучитьОбъектОбработки().ГенерироватьНоменклатуру();
	ПолучитьОбъектОбработки().ГенерироватьЦены(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЦеныНаСервере()
	ПолучитьОбъектОбработки().ОчиститьЦены(Истина);
КонецПроцедуры

&НаСервере
Процедура ГенерироватьШкалыБонусовНаСервере()
	ПолучитьОбъектОбработки().ГенерироватьШкалыБонусов(Истина);
КонецПроцедуры

&НаСервере
Процедура ОчиститьШкалыБонусовНаСервере()
	ПолучитьОбъектОбработки().ОчиститьШкалыБонусов(Истина);
КонецПроцедуры

&НаСервере
Процедура ГенерироватьЗаказыНаСервере()
	
	ПолучитьОбъектОбработки().ГенерироватьКлиентов();
	ПолучитьОбъектОбработки().ГенерироватьВидыКухни();
	ПолучитьОбъектОбработки().ГенерироватьНоменклатуру();
	ПолучитьОбъектОбработки().ГенерироватьКурьеров();
	ПолучитьОбъектОбработки().ГенерироватьВелосипеды();
	ПолучитьОбъектОбработки().ГенерироватьЦены();
	ПолучитьОбъектОбработки().ГенерироватьШкалыБонусов();
	ПолучитьОбъектОбработки().ГенерироватьЗаказы(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЗаказыНаСервере()
	ПолучитьОбъектОбработки().ОчиститьЗаказы(Истина);
КонецПроцедуры

&НаСервере
Процедура ГенерироватьОплатыЗаказовНаСервере()
	
	ПолучитьОбъектОбработки().ГенерироватьКлиентов();
	ПолучитьОбъектОбработки().ГенерироватьВидыКухни();
	ПолучитьОбъектОбработки().ГенерироватьНоменклатуру();
	ПолучитьОбъектОбработки().ГенерироватьКурьеров();
	ПолучитьОбъектОбработки().ГенерироватьВелосипеды();
	ПолучитьОбъектОбработки().ГенерироватьЦены();
	ПолучитьОбъектОбработки().ГенерироватьШкалыБонусов();
	ПолучитьОбъектОбработки().ГенерироватьЗаказы();
	ПолучитьОбъектОбработки().ГенерироватьОплатыЗаказов(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьОплатыЗаказовНаСервере()
	ПолучитьОбъектОбработки().ОчиститьОплатыЗаказов(Истина);
КонецПроцедуры

#КонецОбласти