#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БаллыНаСписаниеПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииПродажи

&НаКлиенте
Процедура ПозицииПродажиТоварПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ТоварПриИзменении(ЭтотОбъект, Объект, Объект.ПозицииПродажи, Элементы.ПозицииПродажи.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиКоличествоПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ПосчитатьИЗаписатьСуммуПозиции(Элементы.ПозицииПродажи.ТекущиеДанные);
	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПослеУдаления(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);

КонецПроцедуры

#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//#КонецОбласти

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ОбработчикиСобытийФормы
//
//#КонецОбласти

//#Область ОбработчикиКомандФормы
//
//#КонецОбласти