#Область ОбработчикиСобытийЭлементовТаблицыФормыТовар

&НаКлиенте
Процедура ТоварТоварПриИзменении(Элемент)
	
	Перем КоличествоПоУмолчанию;

	ДатаВремяЗаказа = Объект.Дата;
	ДатаЗаказа = НачалоДня(ДатаВремяЗаказа);
	ТекущаяСтрока = Элементы.Товар.ТекущиеДанные;
	ВыбраннаяНоменклатура = ТекущаяСтрока.Товар;
	
	Цена = ЗапросыСКлиентаВызовСервера.ПолучитьЦену(ДатаЗаказа, ВыбраннаяНоменклатура);

	Если ЗначениеЗаполнено(Цена) Тогда
		
		КоличествоПоУмолчанию = 1;
		
	Иначе
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Чекни цену, братиш! Чё-то с ней не так: " + Цена;
		Сообщение.Сообщить();
		
		КоличествоПоУмолчанию = 0;
		Цена = 0;
		
	КонецЕсли;
	
	ТекущаяСтрока.ЦенаЗаЕдиницу = Цена;
	ТекущаяСтрока.Количество = КоличествоПоУмолчанию;
	
	ПосчитатьСуммуПозиции(ТекущаяСтрока);
	СуммаЗаказа = ПосчитатьСуммуЗаказа();
	Объект.СуммаЗаказа = СуммаЗаказа;

КонецПроцедуры

&НаКлиенте
Процедура ТоварКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товар.ТекущиеДанные;
	
	ПосчитатьСуммуПозиции(ТекущаяСтрока);
	СуммаЗаказа = ПосчитатьСуммуЗаказа();
	Объект.СуммаЗаказа = СуммаЗаказа;

КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПосчитатьСуммуПозиции(Строка)
	
	Строка.СуммаПозиции = Строка.ЦенаЗаЕдиницу * Строка.Количество;
	
КонецПроцедуры

&НаКлиенте
Функция ПосчитатьСуммуЗаказа()
	
	СуммаЗаказа = 0;
	
	Для Каждого СтрокаТовар из Объект.Товар Цикл

		СуммаЗаказа = СуммаЗаказа + СтрокаТовар.СуммаПозиции;
		
	КонецЦикла;
	
	Возврат СуммаЗаказа;
	
КонецФункции

#КонецОбласти



//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ОбработчикиСобытийФормы
//
//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы
//
//#КонецОбласти

//#Область ОбработчикиКомандФормы
//
//#КонецОбласти