#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БаллыНаСписаниеПриИзменении(Элемент)
	
	ПосчитатьИЗаписатьЗаказ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовар

&НаКлиенте
Процедура ТоварТоварПриИзменении(Элемент)
	
	Перем КоличествоПоУмолчанию;

	ДатаВремяЗаказа = Объект.Дата;
	ДатаЗаказа = НачалоДня(ДатаВремяЗаказа);
	ТекущаяСтрока = Элементы.Товар.ТекущиеДанные;
	ВыбраннаяНоменклатура = ТекущаяСтрока.Товар;
	
	Цена = ЗапросыСКлиентаВызовСервера.ПолучитьЦену(ДатаЗаказа, ВыбраннаяНоменклатура);

	Если ЗначениеЗаполнено(Цена) Тогда
		
		КоличествоПоУмолчанию = 1;
		
	Иначе
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Чекни цену, братиш! Чё-то с ней не так: " + Цена;
		Сообщение.Сообщить();
		
		КоличествоПоУмолчанию = 0;
		Цена = 0;
		
	КонецЕсли;
	
	ТекущаяСтрока.ЦенаЗаЕдиницу = Цена;
	ТекущаяСтрока.Количество = КоличествоПоУмолчанию;
	
	ПосчитатьИЗаписатьСуммуПозиции(ТекущаяСтрока);
	ПосчитатьИЗаписатьЗаказ();

КонецПроцедуры

&НаКлиенте
Процедура ТоварКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товар.ТекущиеДанные;
	
	ПосчитатьИЗаписатьСуммуПозиции(ТекущаяСтрока);
	ПосчитатьИЗаписатьЗаказ();

КонецПроцедуры

&НаКлиенте
Процедура ТоварПослеУдаления(Элемент)

	ПосчитатьИЗаписатьЗаказ();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПосчитатьИЗаписатьЗаказ()
	
	ПосчитатьИЗаписатьЦенуЗаказа();
	ПосчитатьИЗаписатьСуммуЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьИЗаписатьСуммуПозиции(Строка)
	
	Строка.СуммаПозиции = Строка.ЦенаЗаЕдиницу * Строка.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьИЗаписатьЦенуЗаказа()
	
	Цена = 0;
	
	Для Каждого СтрокаТовар Из Объект.Товар Цикл

		Цена = Цена + СтрокаТовар.СуммаПозиции;
		
	КонецЦикла;
	
	Объект.Цена = Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьИЗаписатьСуммуЗаказа()
	
	Объект.СуммаЗаказа = Объект.Цена - Объект.БаллыНаСписание;
	
КонецПроцедуры

#КонецОбласти

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ОбработчикиСобытийФормы
//
//#КонецОбласти

//#Область ОбработчикиКомандФормы
//
//#КонецОбласти