#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Реквизиты
	МаксимальнаяДоляОплатыБаллами = Константы.МаксимальнаяДоляОплатыБаллами.Получить();
	ИнформацияОКлиенте = ОбщийМодульВызовСервера.ПолучитьИнформациюОКлиенте(Объект.Клиент, Объект.Цена);
	СуммаБалловОстаток = ИнформацияОКлиенте.СуммаБалловОстаток;
	ПроцентНакопления = ИнформацияОКлиенте.ПроцентНакопления;
	БаллыКНакоплению = ИнформацияОКлиенте.БаллыКНакоплению;
	ОбщийМодульВызовСервера.СоздатьДекорацииИзбранныхТоваров(ЭтотОбъект, Элементы);
	
	// Общие настройки всех подобных форм
	ОбщийМодульВызовСервера.ПридатьНачальныйВидФормеЗаказа(ЭтотОбъект, Объект, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Параметры)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БаллыНаСписаниеПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ПолучитьБаллыИПоказатьИнформацию(
		ЭтотОбъект,
		Объект.Цена,
		Объект.Клиент,
		МаксимальнаяДоляОплатыБаллами
	);
	
	КлиентПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБаллыКлиентаОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка
	)
	
	ОбщийМодульКлиент.БаллыОбработкаСсылки(
		Объект,
		Объект.БаллыНаСписание,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка
	);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииПродажи

&НаКлиенте
Процедура ПозицииПродажиТоварПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ТоварПриИзменении(
		ЭтотОбъект,
		Объект,
		Объект.ПозицииПродажи,
		Элементы.ПозицииПродажи.ТекущиеДанные
	);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиКоличествоПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ПосчитатьИЗаписатьСуммуПозиции(Элементы.ПозицииПродажи.ТекущиеДанные);
	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПослеУдаления(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, Объект.ПозицииПродажи);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ДекорацияИзбранныхТоваровНажатие(Элемент)
	
	ОбщийМодульКлиент.ИзбранныеНажатие(
		ЭтотОбъект,
		Объект,
		Объект.ПозицииПродажи,
		Элемент,
		ДинамическиеЭлементы
	);

КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()

	ОбщийМодульВызовСервера.ЗаполнитьИзбранныеТовары(
		ЭтотОбъект,
		ДинамическиеЭлементы,
		Объект.Клиент
	);

КонецПроцедуры

#КонецОбласти

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ОбработчикиКомандФормы
//
//#КонецОбласти