#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БаллыНаСписаниеПриИзменении(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииПродажи

&НаКлиенте
Процедура ПозицииПродажиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	ДобавитьУникальнуюПозицию(ПараметрыПеретаскивания.Значение.Товар, ПараметрыПеретаскивания.Значение.ЦенаЗаЕдиницу);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиТоварПриИзменении(Элемент)

	ОбщийМодульКлиент.ТоварПриИзменении(ЭтотОбъект, Объект, ПозицииПродажи, Элементы.ПозицииПродажи.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиКоличествоПриИзменении(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьСуммуПозиции(Элементы.ПозицииПродажи.ТекущиеДанные);
	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПослеУдаления(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	СтандартнаяОбработка = Ложь;

	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Перемещение;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьУникальнуюПозицию(ВыбраннаяСтрока, ДанныеСтроки.Цена);

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		
		Выполнение = Ложь;
		Возврат;
		
	КонецЕсли;
	
	ПеретаскиваемаяСтрока = Новый Структура();
	ПеретаскиваемаяСтрока.Вставить("Товар", ДанныеСтроки.Номенклатура);
	ПеретаскиваемаяСтрока.Вставить("ЦенаЗаЕдиницу", ДанныеСтроки.Цена);
	
	ПараметрыПеретаскивания.Значение = ПеретаскиваемаяСтрока;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиБесценное(Команда)
	
	ПровестиБесценноеНаСервере();
	Оповестить("ОбновитьФормыСпискаЗаказов");

КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗаказ(Команда)
	
	СозданныйДокумент = СохранитьЗаказНаСервере();

	ОповеститьОбИзменении(СозданныйДокумент);
	
	ПоказатьОповещениеПользователя(
		"Создан новый заказ",
		ПолучитьНавигационнуюСсылку(СозданныйДокумент),
		Строка(СозданныйДокумент),
		БиблиотекаКартинок.ЗакончитьРедактирование,
		СтатусОповещенияПользователя.Важное,
		"НовыйЗаказИзРабочегоМестаМенеджера"
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПровестиБесценноеНаСервере()
	Документы.Заказ.ПровестиДокументыСБесценнымиТоварами();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУникальнуюПозицию(Номенклатура, Цена)
	
	ФильтрПозицийПродаж = Новый Структура;
	ФильтрПозицийПродаж.Вставить("Товар", Номенклатура);
	
	ОтфильтрованныеСтроки = ПозицииПродажи.НайтиСтроки(ФильтрПозицийПродаж);
	
	Если ОтфильтрованныеСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемаяСтрока = ПозицииПродажи.Добавить();
	ДобавляемаяСтрока.Товар = Номенклатура;
	ДобавляемаяСтрока.ЦенаЗаЕдиницу = Цена;
	ДобавляемаяСтрока.Количество = 1;
	ДобавляемаяСтрока.СуммаПозиции = Цена;
	
	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);
	
КонецПроцедуры

&НаСервере
Функция СохранитьЗаказНаСервере()

	ДокументЗаказ = Документы.Заказ.СоздатьДокумент();
	
	ДокументЗаказ.Заполнить(Неопределено);
	
	ДокументЗаказ.Дата = ТекущаяДатаСеанса();
	ДокументЗаказ.Клиент = Клиент;
	ДокументЗаказ.Цена = Цена;
	ДокументЗаказ.БаллыНаСписание = БаллыНаСписание;
	ДокументЗаказ.СуммаЗаказа = СуммаЗаказа;
	
	ДокументЗаказ.ПозицииПродажи.Загрузить(ПозицииПродажи.Выгрузить());

	Если Не ДокументЗаказ.ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;

	ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокументЗаказ.Ссылка;

КонецФункции

#КонецОбласти

