#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Реквизиты
	МаксимальнаяДоляОплатыБаллами = Константы.МаксимальнаяДоляОплатыБаллами.Получить();
	ИнформацияОКлиенте = ОбщийМодульВызовСервера.ПолучитьИнформациюОКлиенте(Клиент, Цена);
	СуммаБалловОстаток = ИнформацияОКлиенте.СуммаБалловОстаток;
	ПроцентНакопления = ИнформацияОКлиенте.ПроцентНакопления;
	БаллыКНакоплению = ИнформацияОКлиенте.БаллыКНакоплению;
	ОбщийМодульВызовСервера.СоздатьДекорацииИзбранныхТоваров(ЭтотОбъект, Элементы);
	
	// Элементы
	Элементы.СписокНоменклатуры.Видимость = Ложь;
	Элементы.ПозицииПродажиПодбор.Пометка = Ложь;
	
	// Общие настройки всех подобных форм
	ОбщийМодульВызовСервера.ПридатьНачальныйВидФормеЗаказа(ЭтотОбъект, Объект, Элементы);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(Клиент) Тогда
		ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БаллыНаСписаниеПриИзменении(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);

КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)

	ОбщийМодульКлиент.ПолучитьБаллыИПоказатьИнформацию(
		ЭтотОбъект,
		Цена,
		Клиент,
		МаксимальнаяДоляОплатыБаллами
	);
	
	КлиентПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБаллыКлиентаОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка
	)
	
	ОбщийМодульКлиент.БаллыОбработкаСсылки(
		ЭтотОбъект,
		БаллыНаСписание,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка
	);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииПродажи

&НаКлиенте
Процедура ПозицииПродажиПроверкаПеретаскивания(
		Элемент,
		ПараметрыПеретаскивания,
		СтандартнаяОбработка,
		Строка,
		Поле
	)

	СтандартнаяОбработка = Ложь;

	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Перемещение;

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПеретаскивание(
		Элемент,
		ПараметрыПеретаскивания,
		СтандартнаяОбработка,
		Строка,
		Поле
	)

	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	ОбщийМодульКлиент.ДобавитьУникальнуюПозицию(
		ЭтотОбъект,
		Объект,
		ПозицииПродажи,
		ПараметрыПеретаскивания.Значение.Товар,
		ПараметрыПеретаскивания.Значение.ЦенаЗаЕдиницу
	);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиТоварПриИзменении(Элемент)

	ОбщийМодульКлиент.ТоварПриИзменении(
		ЭтотОбъект,
		Объект,
		ПозицииПродажи,
		Элементы.ПозицииПродажи.ТекущиеДанные
	);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиКоличествоПриИзменении(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьСуммуПозиции(Элементы.ПозицииПродажи.ТекущиеДанные);
	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПослеУдаления(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийМодульКлиент.ДобавитьУникальнуюПозицию(
		ЭтотОбъект,
		Объект,
		ПозицииПродажи,
		ВыбраннаяСтрока,
		ДанныеСтроки.Цена
	);

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		
		Выполнение = Ложь;
		Возврат;
		
	КонецЕсли;
	
	ПеретаскиваемаяСтрока = Новый Структура();
	ПеретаскиваемаяСтрока.Вставить("Товар", ДанныеСтроки.Номенклатура);
	ПеретаскиваемаяСтрока.Вставить("ЦенаЗаЕдиницу", ДанныеСтроки.Цена);
	
	ПараметрыПеретаскивания.Значение = ПеретаскиваемаяСтрока;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиБесценное(Команда)
	
	ПровестиБесценноеНаСервере();
	Оповестить("ОбновитьФормыСпискаЗаказов");

КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗаказ(Команда)
	
	СозданныйДокумент = СохранитьЗаказНаСервере();

	Если Не ЗначениеЗаполнено(СозданныйДокумент) Тогда
		Возврат;
	КонецЕсли;

	ОповеститьОбИзменении(СозданныйДокумент);
	
	ПоказатьОповещениеПользователя(
		"Создан новый заказ",
		ПолучитьНавигационнуюСсылку(СозданныйДокумент),
		Строка(СозданныйДокумент),
		БиблиотекаКартинок.ЗакончитьРедактирование,
		СтатусОповещенияПользователя.Важное,
		"НовыйЗаказИзРабочегоМестаМенеджера"
	);

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)

	Элементы.СписокНоменклатуры.Видимость = Не Элементы.СписокНоменклатуры.Видимость;
	Элементы.ПозицииПродажиПодбор.Пометка = Элементы.СписокНоменклатуры.Видимость;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ДекорацияИзбранныхТоваровНажатие(Элемент)
	
	ОбщийМодульКлиент.ИзбранныеНажатие(
		ЭтотОбъект,
		Объект,
		ПозицииПродажи,
		Элемент,
		ДинамическиеЭлементы
	);
	
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()

	ОбщийМодульВызовСервера.ЗаполнитьИзбранныеТовары(
		ЭтотОбъект,
		ДинамическиеЭлементы,
		Клиент
	);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПровестиБесценноеНаСервере()
	Документы.Заказ.ПровестиДокументыСБесценнымиТоварами();
КонецПроцедуры

&НаСервере
Функция СохранитьЗаказНаСервере()

	ДокументЗаказ = Документы.Заказ.СоздатьДокумент();
	
	ДокументЗаказ.Заполнить(Неопределено);
	
	ДокументЗаказ.Дата = ТекущаяДатаСеанса();
	ДокументЗаказ.Клиент = Клиент;
	ДокументЗаказ.Цена = Цена;
	ДокументЗаказ.БаллыНаСписание = БаллыНаСписание;
	ДокументЗаказ.СуммаЗаказа = СуммаЗаказа;
	
	ДокументЗаказ.ПозицииПродажи.Загрузить(ПозицииПродажи.Выгрузить());

	Если Не ДокументЗаказ.ПроверитьЗаполнение() Тогда
		Возврат Неопределено;
	КонецЕсли;

	ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	
	Если ДокументЗаказ.Проведен Тогда

		ОбщийМодульВызовСервера.ОчиститьФорму(ЭтотОбъект, Объект, Элементы);
		Возврат ДокументЗаказ.Ссылка;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

#КонецОбласти