//#Область ОписаниеПеременных
//
//#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СкрытьПоказатьЭлементы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	СкрытьПоказатьЭлементы();

КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиКомандФормы
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СкрытьПоказатьЭлементы()
	
	ЭтоНоменклатураТовар = (Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Товар);
	
	Элементы.ВидКухни.Видимость = ЭтоНоменклатураТовар;
	Элементы.КоличествоЗаказов.Видимость = ЭтоНоменклатураТовар;
	
КонецПроцедуры

#КонецОбласти